RT-Thread/rt-thread/bsp/at32/Libraries/AT32_Std_Driver/AT32F4xx_StdPeriph_Driver/src/at32f4xx_tim.c
/**
 **************************************************************************
 * File Name    : at32f4xx_tim.c
 * Description  : at32f4xx TTMER source file
 * Date         : 2018-10-08
 * Version      : V1.0.5
 **************************************************************************
 */


/* Includes ------------------------------------------------------------------*/
#include "at32f4xx_tim.h"
#include "at32f4xx_rcc.h"

/** @addtogroup at32f4xx_StdPeriph_Driver
  * @{
  */

/** @defgroup TMR
  * @brief TMR driver modules
  * @{
  */

/** @defgroup TMR_Private_TypesDefinitions
  * @{
  */

/**
  * @}
  */

/** @defgroup TMR_Private_Defines
  * @{
  */

/* ---------------------- TMR registers bit mask ------------------------ */
#define SMC_ETR_Mask               ((uint16_t)0x00FF)
#define CCMR_Offset                ((uint16_t)0x0018)
#define CCE_CCE_Set                ((uint16_t)0x0001)
#define CCE_CCNE_Set               ((uint16_t)0x0004)

/**
  * @}
  */

/** @defgroup TMR_Private_Macros
  * @{
  */

/**
  * @}
  */

/** @defgroup TMR_Private_Variables
  * @{
  */

/**
  * @}
  */

/** @defgroup TMR_Private_FunctionPrototypes
  * @{
  */

static void TI1_Config(TMR_Type* TMRx, uint16_t TMR_ICPolarity, uint16_t TMR_ICSelection,
                       uint16_t TMR_ICFilter);
static void TI2_Config(TMR_Type* TMRx, uint16_t TMR_ICPolarity, uint16_t TMR_ICSelection,
                       uint16_t TMR_ICFilter);
static void TI3_Config(TMR_Type* TMRx, uint16_t TMR_ICPolarity, uint16_t TMR_ICSelection,
                       uint16_t TMR_ICFilter);
static void TI4_Config(TMR_Type* TMRx, uint16_t TMR_ICPolarity, uint16_t TMR_ICSelection,
                       uint16_t TMR_ICFilter);
/**
  * @}
  */

/** @defgroup TMR_Private_Macros
  * @{
  */

/**
  * @}
  */

/** @defgroup TMR_Private_Variables
  * @{
  */

/**
  * @}
  */

/** @defgroup TMR_Private_FunctionPrototypes
  * @{
  */

/**
  * @}
  */

/** @defgroup TMR_Private_Functions
  * @{
  */

/**
  * @brief  Deinitializes the TMRx peripheral registers to their default reset values.
  * @param  TMRx: where x can be 1 to 15 to select the TMR peripheral.
  * @retval None
  */
void TMR_Reset(TMR_Type* TMRx)
{
  /* Check the parameters */
  assert_param(IS_TMR_ALL_PERIPH(TMRx));

  if (TMRx == TMR1)
  {
    RCC_APB2PeriphResetCmd(RCC_APB2PERIPH_TMR1, ENABLE);
    RCC_APB2PeriphResetCmd(RCC_APB2PERIPH_TMR1, DISABLE);
  }
  else if (TMRx == TMR2)
  {
    RCC_APB1PeriphResetCmd(RCC_APB1PERIPH_TMR2, ENABLE);
    RCC_APB1PeriphResetCmd(RCC_APB1PERIPH_TMR2, DISABLE);
  }
  else if (TMRx == TMR3)
  {
    RCC_APB1PeriphResetCmd(RCC_APB1PERIPH_TMR3, ENABLE);
    RCC_APB1PeriphResetCmd(RCC_APB1PERIPH_TMR3, DISABLE);
  }
  else if (TMRx == TMR4)
  {
    RCC_APB1PeriphResetCmd(RCC_APB1PERIPH_TMR4, ENABLE);
    RCC_APB1PeriphResetCmd(RCC_APB1PERIPH_TMR4, DISABLE);
  }
  else if (TMRx == TMR5)
  {
    RCC_APB1PeriphResetCmd(RCC_APB1PERIPH_TMR5, ENABLE);
    RCC_APB1PeriphResetCmd(RCC_APB1PERIPH_TMR5, DISABLE);
  }
#if defined (AT32F403xx)
  else if (TMRx == TMR6)
  {
    RCC_APB1PeriphResetCmd(RCC_APB1PERIPH_TMR6, ENABLE);
    RCC_APB1PeriphResetCmd(RCC_APB1PERIPH_TMR6, DISABLE);
  }
  else if (TMRx == TMR7)
  {
    RCC_APB1PeriphResetCmd(RCC_APB1PERIPH_TMR7, ENABLE);
    RCC_APB1PeriphResetCmd(RCC_APB1PERIPH_TMR7, DISABLE);
  }
#endif
#if defined (AT32F403xx) || defined (AT32F413xx)
  else if (TMRx == TMR8)
  {
    RCC_APB2PeriphResetCmd(RCC_APB2PERIPH_TMR8, ENABLE);
    RCC_APB2PeriphResetCmd(RCC_APB2PERIPH_TMR8, DISABLE);
  }
#endif
  else if (TMRx == TMR9)
  {
    RCC_APB2PeriphResetCmd(RCC_APB2PERIPH_TMR9, ENABLE);
    RCC_APB2PeriphResetCmd(RCC_APB2PERIPH_TMR9, DISABLE);
  }
  else if (TMRx == TMR10)
  {
    RCC_APB2PeriphResetCmd(RCC_APB2PERIPH_TMR10, ENABLE);
    RCC_APB2PeriphResetCmd(RCC_APB2PERIPH_TMR10, DISABLE);
  }
  else if (TMRx == TMR11)
  {
    RCC_APB2PeriphResetCmd(RCC_APB2PERIPH_TMR11, ENABLE);
    RCC_APB2PeriphResetCmd(RCC_APB2PERIPH_TMR11, DISABLE);
  }
#if defined (AT32F403xx)
  else if (TMRx == TMR12)
  {
    RCC_APB1PeriphResetCmd(RCC_APB1PERIPH_TMR12, ENABLE);
    RCC_APB1PeriphResetCmd(RCC_APB1PERIPH_TMR12, DISABLE);
  }
  else if (TMRx == TMR13)
  {
    RCC_APB1PeriphResetCmd(RCC_APB1PERIPH_TMR13, ENABLE);
    RCC_APB1PeriphResetCmd(RCC_APB1PERIPH_TMR13, DISABLE);
  }
  else if (TMRx == TMR14)
  {
    RCC_APB1PeriphResetCmd(RCC_APB1PERIPH_TMR14, ENABLE);
    RCC_APB1PeriphResetCmd(RCC_APB1PERIPH_TMR14, DISABLE);
  }
  else if (TMRx == TMR15)
  {
    RCC_APB2PeriphResetCmd(RCC_APB2PERIPH_TMR15, ENABLE);
    RCC_APB2PeriphResetCmd(RCC_APB2PERIPH_TMR15, DISABLE);
  }
#endif
}

/**
  * @brief  Initializes the TMRx Time Base Unit peripheral according to
  *         the specified parameters in the TMR_TimeBaseInitStruct.
  * @param  TMRx: where x can be 1 to 15 to select the TMR peripheral.
  * @param  TMR_TimeBaseInitStruct: pointer to a TMR_TimerBaseInitType
  *         structure that contains the configuration information for the
  *         specified TMR peripheral.
  * @retval None
  */
void TMR_TimeBaseInit(TMR_Type* TMRx, TMR_TimerBaseInitType* TMR_TimeBaseInitStruct)
{
  uint16_t tmpcr1 = 0;

  /* Check the parameters */
  assert_param(IS_TMR_ALL_PERIPH(TMRx));
  assert_param(IS_TMR_COUNTER_DIR(TMR_TimeBaseInitStruct->TMR_CounterMode));
  assert_param(IS_TMR_CKD_DIV(TMR_TimeBaseInitStruct->TMR_ClockDivision));

  tmpcr1 = TMRx->CTRL1;

  if((TMRx == TMR1) || (TMRx == TMR2) ||
#if !defined (AT32F415xx)
     (TMRx == TMR8) ||
#endif
#if defined (AT32F403xx)
     (TMRx == TMR15) ||
#endif
     (TMRx == TMR3) || (TMRx == TMR4) || (TMRx == TMR5))
  {
    /* Select the Counter Mode */
    tmpcr1 &= (uint16_t)(~((uint16_t)(TMR_CTRL1_DIR | TMR_CTRL1_CMSEL)));
    tmpcr1 |= (uint32_t)TMR_TimeBaseInitStruct->TMR_CounterMode;
  }

#ifdef AT32F403xx
  if((TMRx != TMR6) && (TMRx != TMR7))
  {
    /* Set the clock division */
    tmpcr1 &= (uint16_t)(~((uint16_t)TMR_CTRL1_CLKDIV));
    tmpcr1 |= (uint32_t)TMR_TimeBaseInitStruct->TMR_ClockDivision;
  }
#endif

  TMRx->CTRL1 = tmpcr1;

  /* Set the Autoreload value */
  TMRx->AR = TMR_TimeBaseInitStruct->TMR_Period ;

