RT-Thread/rt-thread/bsp/at32/Libraries/AT32_Std_Driver/AT32F4xx_StdPeriph_Driver/src/at32f4xx_tim.c
  /* Set the Prescaler value */
  TMRx->DIV = TMR_TimeBaseInitStruct->TMR_DIV;

#ifdef AT32F415xx
    if (TMRx == TMR1)
#elif defined AT32F413xx
    if ((TMRx == TMR1) || (TMRx == TMR8))
#elif defined AT32F403xx
    if ((TMRx == TMR1) || (TMRx == TMR8) || (TMRx == TMR15))
#endif
  {
    /* Set the Repetition Counter value */
    TMRx->RC = TMR_TimeBaseInitStruct->TMR_RepetitionCounter;
  }

  /* Generate an update event to reload the Prescaler and the Repetition counter
     values immediately */
  TMRx->EVEG = TMR_DIVReloadMode_Immediate;
}

/**
  * @brief  Initializes the TIMx Plus Mode according to the specified
  *         parameters.
  * @param  TIMx: where x can be  2 or 5 to select the TIM peripheral.
  * @param  TIMx_PLUS_MODE_STATE: eable or disable the plus mode
  * @ex     TMR_Plus_Mode_Enable
  *         TMR_Plus_Mode_Disable
  * @retval None
  */
void TMR_SelectPlusMode(TMR_Type* TMRx, uint16_t TMRx_PLUS_MODE_STATE)
{
    /* Check the parameters */
  assert_param(IS_TMR_PLUSMODE_PERIPH(TMRx));
    assert_param(IS_TMR_PLUS_MODE_STATE(TMRx_PLUS_MODE_STATE));
    /*Config TIMx plus mode*/
    if((TMRx == TMR2) || (TMRx == TMR5))
    {
        /*Enable*/
        if(TMRx_PLUS_MODE_STATE)
        {
            TMRx->CTRL1 &= (uint16_t)(~((uint16_t)TMR_Plus_Mode_Enable));
            TMRx->CTRL1 |= TMRx_PLUS_MODE_STATE;
        }
        /*Disable*/
        else
        {
            TMRx->CTRL1 &= (uint16_t)(~((uint16_t)TMR_Plus_Mode_Enable));
            TMRx->CTRL1 |= TMRx_PLUS_MODE_STATE;
        }
    }
}



/**
  * @brief  Initializes the TMRx Channel1 according to the specified
  *         parameters in the TMR_OCInitStruct.
  * @param  TMRx: where x can be  1 to 15 except 6 and 7 to select the TMR peripheral.
  * @param  TMR_OCInitStruct: pointer to a TMR_OCInitType structure
  *         that contains the configuration information for the specified TMR peripheral.
  * @retval None
  */
void TMR_OC1Init(TMR_Type* TMRx, TMR_OCInitType* TMR_OCInitStruct)
{
  uint16_t tmpccmrx = 0, tmpccer = 0, tmpcr2 = 0;

  /* Check the parameters */
  assert_param(IS_TMR_LIST8_PERIPH(TMRx));
  assert_param(IS_TMR_OC_MODE(TMR_OCInitStruct->TMR_OCMode));
  assert_param(IS_TMR_OUTPUT_STATE(TMR_OCInitStruct->TMR_OutputState));
  assert_param(IS_TMR_OC_POLARITY(TMR_OCInitStruct->TMR_OCPolarity));
  /* Disable the Channel 1: Reset the CC1E Bit */
  TMRx->CCE &= (uint16_t)(~(uint16_t)TMR_CCE_C1EN);
  /* Get the TMRx CCE register value */
  tmpccer = TMRx->CCE;
  /* Get the TMRx CR2 register value */
  tmpcr2 =  TMRx->CTRL2;

  /* Get the TMRx CCMR1 register value */
  tmpccmrx = TMRx->CCM1;

  /* Reset the Output Compare Mode Bits */
  tmpccmrx &= (uint16_t)(~((uint16_t)TMR_CCM1_OC1MODE));
  tmpccmrx &= (uint16_t)(~((uint16_t)TMR_CCM1_C1SEL));

  /* Select the Output Compare Mode */
  tmpccmrx |= TMR_OCInitStruct->TMR_OCMode;

  /* Reset the Output Polarity level */
  tmpccer &= (uint16_t)(~((uint16_t)TMR_CCE_C1P));
  /* Set the Output Compare Polarity */
  tmpccer |= TMR_OCInitStruct->TMR_OCPolarity;

  /* Set the Output State */
  tmpccer |= TMR_OCInitStruct->TMR_OutputState;

#ifdef AT32F415xx
    if (TMRx == TMR1)
#elif defined AT32F413xx
    if ((TMRx == TMR1) || (TMRx == TMR8))
#elif defined AT32F403xx
    if ((TMRx == TMR1) || (TMRx == TMR8) || (TMRx == TMR15))
#endif
  {
    assert_param(IS_TMR_OUTPUTN_STATE(TMR_OCInitStruct->TMR_OutputNState));
    assert_param(IS_TMR_OCN_POLARITY(TMR_OCInitStruct->TMR_OCNPolarity));
    assert_param(IS_TMR_OCNIDLE_STATE(TMR_OCInitStruct->TMR_OCNIdleState));
    assert_param(IS_TMR_OCIDLE_STATE(TMR_OCInitStruct->TMR_OCIdleState));

    /* Reset the Output N Polarity level */
    tmpccer &= (uint16_t)(~((uint16_t)TMR_CCE_C1NP));
    /* Set the Output N Polarity */
    tmpccer |= TMR_OCInitStruct->TMR_OCNPolarity;

    /* Reset the Output N State */
    tmpccer &= (uint16_t)(~((uint16_t)TMR_CCE_C1NEN));
    /* Set the Output N State */
    tmpccer |= TMR_OCInitStruct->TMR_OutputNState;

    /* Reset the Output Compare and Output Compare N IDLE State */
    tmpcr2 &= (uint16_t)(~((uint16_t)TMR_CTRL2_OC1IS));
    tmpcr2 &= (uint16_t)(~((uint16_t)TMR_CTRL2_OC1NIS));

    /* Set the Output Idle state */
    tmpcr2 |= TMR_OCInitStruct->TMR_OCIdleState;
    /* Set the Output N Idle state */
    tmpcr2 |= TMR_OCInitStruct->TMR_OCNIdleState;
  }

  /* Write to TMRx CR2 */
  TMRx->CTRL2 = tmpcr2;

  /* Write to TMRx CCMR1 */
  TMRx->CCM1 = tmpccmrx;

  /* Set the Capture Compare Register value */
  TMRx->CC1 = TMR_OCInitStruct->TMR_Pulse;

  /* Write to TMRx CCE */
  TMRx->CCE = tmpccer;
}

/**
  * @brief  Initializes the TMRx Channel2 according to the specified
  *         parameters in the TMR_OCInitStruct.
  * @param  TMRx: where x can be  1, 2, 3, 4, 5, 8, 9, 12 or 15 to select
  *         the TMR peripheral.
  * @param  TMR_OCInitStruct: pointer to a TMR_OCInitType structure
  *         that contains the configuration information for the specified TMR peripheral.
  * @retval None
  */
void TMR_OC2Init(TMR_Type* TMRx, TMR_OCInitType* TMR_OCInitStruct)
{
  uint16_t tmpccmrx = 0, tmpccer = 0, tmpcr2 = 0;

  /* Check the parameters */
  assert_param(IS_TMR_LIST6_PERIPH(TMRx));
  assert_param(IS_TMR_OC_MODE(TMR_OCInitStruct->TMR_OCMode));
  assert_param(IS_TMR_OUTPUT_STATE(TMR_OCInitStruct->TMR_OutputState));
  assert_param(IS_TMR_OC_POLARITY(TMR_OCInitStruct->TMR_OCPolarity));
  /* Disable the Channel 2: Reset the CC2E Bit */
  TMRx->CCE &= (uint16_t)(~((uint16_t)TMR_CCE_C2EN));

  /* Get the TMRx CCE register value */
  tmpccer = TMRx->CCE;
  /* Get the TMRx CR2 register value */
  tmpcr2 =  TMRx->CTRL2;

  /* Get the TMRx CCMR1 register value */
  tmpccmrx = TMRx->CCM1;

  /* Reset the Output Compare mode and Capture/Compare selection Bits */
  tmpccmrx &= (uint16_t)(~((uint16_t)TMR_CCM1_OC2MODE));
  tmpccmrx &= (uint16_t)(~((uint16_t)TMR_CCM1_C2SEL));

  /* Select the Output Compare Mode */
  tmpccmrx |= (uint16_t)(TMR_OCInitStruct->TMR_OCMode << 8);

  /* Reset the Output Polarity level */
  tmpccer &= (uint16_t)(~((uint16_t)TMR_CCE_C2P));
  /* Set the Output Compare Polarity */
  tmpccer |= (uint16_t)(TMR_OCInitStruct->TMR_OCPolarity << 4);

  /* Set the Output State */
  tmpccer |= (uint16_t)(TMR_OCInitStruct->TMR_OutputState << 4);

#ifdef AT32F415xx
    if (TMRx == TMR1)
#elif defined AT32F413xx
    if ((TMRx == TMR1) || (TMRx == TMR8))
#elif defined AT32F403xx
    if ((TMRx == TMR1) || (TMRx == TMR8) || (TMRx == TMR15))
#endif
  {
    assert_param(IS_TMR_OUTPUTN_STATE(TMR_OCInitStruct->TMR_OutputNState));
    assert_param(IS_TMR_OCN_POLARITY(TMR_OCInitStruct->TMR_OCNPolarity));
    assert_param(IS_TMR_OCNIDLE_STATE(TMR_OCInitStruct->TMR_OCNIdleState));
    assert_param(IS_TMR_OCIDLE_STATE(TMR_OCInitStruct->TMR_OCIdleState));

    /* Reset the Output N Polarity level */
    tmpccer &= (uint16_t)(~((uint16_t)TMR_CCE_C2NP));
    /* Set the Output N Polarity */
    tmpccer |= (uint16_t)(TMR_OCInitStruct->TMR_OCNPolarity << 4);

    /* Reset the Output N State */
    tmpccer &= (uint16_t)(~((uint16_t)TMR_CCE_C2NEN));
    /* Set the Output N State */
    tmpccer |= (uint16_t)(TMR_OCInitStruct->TMR_OutputNState << 4);

    /* Reset the Output Compare and Output Compare N IDLE State */
    tmpcr2 &= (uint16_t)(~((uint16_t)TMR_CTRL2_OC2IS));
    tmpcr2 &= (uint16_t)(~((uint16_t)TMR_CTRL2_OC2NIS));

    /* Set the Output Idle state */
    tmpcr2 |= (uint16_t)(TMR_OCInitStruct->TMR_OCIdleState << 2);
    /* Set the Output N Idle state */
    tmpcr2 |= (uint16_t)(TMR_OCInitStruct->TMR_OCNIdleState << 2);
  }

  /* Write to TMRx CR2 */
  TMRx->CTRL2 = tmpcr2;

