RT-Thread/rt-thread/bsp/at32/Libraries/AT32_Std_Driver/AT32F4xx_StdPeriph_Driver/src/at32f4xx_tim.c
  /* Write to TMRx CCMR1 */
  TMRx->CCM1 = tmpccmrx;

  /* Set the Capture Compare Register value */
  TMRx->CC2 = TMR_OCInitStruct->TMR_Pulse;

  /* Write to TMRx CCE */
  TMRx->CCE = tmpccer;
}

/**
  * @brief  Initializes the TMRx Channel3 according to the specified
  *         parameters in the TMR_OCInitStruct.
  * @param  TMRx: where x can be  1, 2, 3, 4, 5 or 8 to select the TMR peripheral.
  * @param  TMR_OCInitStruct: pointer to a TMR_OCInitType structure
  *         that contains the configuration information for the specified TMR peripheral.
  * @retval None
  */
void TMR_OC3Init(TMR_Type* TMRx, TMR_OCInitType* TMR_OCInitStruct)
{
  uint16_t tmpccmrx = 0, tmpccer = 0, tmpcr2 = 0;

  /* Check the parameters */
  assert_param(IS_TMR_LIST3_PERIPH(TMRx));
  assert_param(IS_TMR_OC_MODE(TMR_OCInitStruct->TMR_OCMode));
  assert_param(IS_TMR_OUTPUT_STATE(TMR_OCInitStruct->TMR_OutputState));
  assert_param(IS_TMR_OC_POLARITY(TMR_OCInitStruct->TMR_OCPolarity));
  /* Disable the Channel 2: Reset the CC2E Bit */
  TMRx->CCE &= (uint16_t)(~((uint16_t)TMR_CCE_C3EN));

  /* Get the TMRx CCE register value */
  tmpccer = TMRx->CCE;
  /* Get the TMRx CR2 register value */
  tmpcr2 =  TMRx->CTRL2;

  /* Get the TMRx CCMR2 register value */
  tmpccmrx = TMRx->CCM2;

  /* Reset the Output Compare mode and Capture/Compare selection Bits */
  tmpccmrx &= (uint16_t)(~((uint16_t)TMR_CCM2_OC3MODE));
  tmpccmrx &= (uint16_t)(~((uint16_t)TMR_CCM2_C3SEL));
  /* Select the Output Compare Mode */
  tmpccmrx |= TMR_OCInitStruct->TMR_OCMode;

  /* Reset the Output Polarity level */
  tmpccer &= (uint16_t)(~((uint16_t)TMR_CCE_C3P));
  /* Set the Output Compare Polarity */
  tmpccer |= (uint16_t)(TMR_OCInitStruct->TMR_OCPolarity << 8);

  /* Set the Output State */
  tmpccer |= (uint16_t)(TMR_OCInitStruct->TMR_OutputState << 8);

#ifdef AT32F415xx
    if (TMRx == TMR1)
#elif defined AT32F413xx
    if ((TMRx == TMR1) || (TMRx == TMR8))
#elif defined AT32F403xx
    if ((TMRx == TMR1) || (TMRx == TMR8) || (TMRx == TMR15))
#endif
  {
    assert_param(IS_TMR_OUTPUTN_STATE(TMR_OCInitStruct->TMR_OutputNState));
    assert_param(IS_TMR_OCN_POLARITY(TMR_OCInitStruct->TMR_OCNPolarity));
    assert_param(IS_TMR_OCNIDLE_STATE(TMR_OCInitStruct->TMR_OCNIdleState));
    assert_param(IS_TMR_OCIDLE_STATE(TMR_OCInitStruct->TMR_OCIdleState));

    /* Reset the Output N Polarity level */
    tmpccer &= (uint16_t)(~((uint16_t)TMR_CCE_C3NP));
    /* Set the Output N Polarity */
    tmpccer |= (uint16_t)(TMR_OCInitStruct->TMR_OCNPolarity << 8);
    /* Reset the Output N State */
    tmpccer &= (uint16_t)(~((uint16_t)TMR_CCE_C3NEN));

    /* Set the Output N State */
    tmpccer |= (uint16_t)(TMR_OCInitStruct->TMR_OutputNState << 8);
    /* Reset the Output Compare and Output Compare N IDLE State */
    tmpcr2 &= (uint16_t)(~((uint16_t)TMR_CTRL2_OC3IS));
    tmpcr2 &= (uint16_t)(~((uint16_t)TMR_CTRL2_OC3NIS));
    /* Set the Output Idle state */
    tmpcr2 |= (uint16_t)(TMR_OCInitStruct->TMR_OCIdleState << 4);
    /* Set the Output N Idle state */
    tmpcr2 |= (uint16_t)(TMR_OCInitStruct->TMR_OCNIdleState << 4);
  }

  /* Write to TMRx CR2 */
  TMRx->CTRL2 = tmpcr2;

  /* Write to TMRx CCMR2 */
  TMRx->CCM2 = tmpccmrx;

  /* Set the Capture Compare Register value */
  TMRx->CC3 = TMR_OCInitStruct->TMR_Pulse;

  /* Write to TMRx CCE */
  TMRx->CCE = tmpccer;
}

/**
  * @brief  Initializes the TMRx Channel4 according to the specified
  *         parameters in the TMR_OCInitStruct.
  * @param  TMRx: where x can be  1, 2, 3, 4, 5 or 8 to select the TMR peripheral.
  * @param  TMR_OCInitStruct: pointer to a TMR_OCInitType structure
  *         that contains the configuration information for the specified TMR peripheral.
  * @retval None
  */
void TMR_OC4Init(TMR_Type* TMRx, TMR_OCInitType* TMR_OCInitStruct)
{
  uint16_t tmpccmrx = 0, tmpccer = 0, tmpcr2 = 0;

  /* Check the parameters */
  assert_param(IS_TMR_LIST3_PERIPH(TMRx));
  assert_param(IS_TMR_OC_MODE(TMR_OCInitStruct->TMR_OCMode));
  assert_param(IS_TMR_OUTPUT_STATE(TMR_OCInitStruct->TMR_OutputState));
  assert_param(IS_TMR_OC_POLARITY(TMR_OCInitStruct->TMR_OCPolarity));
  /* Disable the Channel 2: Reset the CC4E Bit */
  TMRx->CCE &= (uint16_t)(~((uint16_t)TMR_CCE_C4EN));

  /* Get the TMRx CCE register value */
  tmpccer = TMRx->CCE;
  /* Get the TMRx CR2 register value */
  tmpcr2 =  TMRx->CTRL2;

  /* Get the TMRx CCMR2 register value */
  tmpccmrx = TMRx->CCM2;

  /* Reset the Output Compare mode and Capture/Compare selection Bits */
  tmpccmrx &= (uint16_t)(~((uint16_t)TMR_CCM2_OC4MODE));
  tmpccmrx &= (uint16_t)(~((uint16_t)TMR_CCM2_CC4S));

  /* Select the Output Compare Mode */
  tmpccmrx |= (uint16_t)(TMR_OCInitStruct->TMR_OCMode << 8);

  /* Reset the Output Polarity level */
  tmpccer &= (uint16_t)(~((uint16_t)TMR_CCE_C4P));
  /* Set the Output Compare Polarity */
  tmpccer |= (uint16_t)(TMR_OCInitStruct->TMR_OCPolarity << 12);

  /* Set the Output State */
  tmpccer |= (uint16_t)(TMR_OCInitStruct->TMR_OutputState << 12);

#ifdef AT32F415xx
    if (TMRx == TMR1)
#elif defined AT32F413xx
    if ((TMRx == TMR1) || (TMRx == TMR8))
#elif defined AT32F403xx
    if ((TMRx == TMR1) || (TMRx == TMR8) || (TMRx == TMR15))
#endif
  {
    assert_param(IS_TMR_OCIDLE_STATE(TMR_OCInitStruct->TMR_OCIdleState));
    /* Reset the Output Compare IDLE State */
    tmpcr2 &= (uint16_t)(~((uint16_t)TMR_CTRL2_OC4IS));
    /* Set the Output Idle state */
    tmpcr2 |= (uint16_t)(TMR_OCInitStruct->TMR_OCIdleState << 6);
  }

  /* Write to TMRx CR2 */
  TMRx->CTRL2 = tmpcr2;

  /* Write to TMRx CCMR2 */
  TMRx->CCM2 = tmpccmrx;

  /* Set the Capture Compare Register value */
  TMRx->CC4 = TMR_OCInitStruct->TMR_Pulse;

  /* Write to TMRx CCE */
  TMRx->CCE = tmpccer;
}

/**
  * @brief  Initializes the TMR peripheral according to the specified
  *         parameters in the TMR_ICInitStruct.
  * @param  TMRx: where x can be  1 to 15 except 6 and 7 to select the TMR peripheral.
  * @param  TMR_ICInitStruct: pointer to a TMR_ICInitType structure
  *         that contains the configuration information for the specified TMR peripheral.
  * @retval None
  */
void TMR_ICInit(TMR_Type* TMRx, TMR_ICInitType* TMR_ICInitStruct)
{
  /* Check the parameters */
  assert_param(IS_TMR_CHANNEL(TMR_ICInitStruct->TMR_Channel));
  assert_param(IS_TMR_IC_SELECTION(TMR_ICInitStruct->TMR_ICSelection));
  assert_param(IS_TMR_IC_DIV(TMR_ICInitStruct->TMR_ICDIV));
  assert_param(IS_TMR_IC_FILTER(TMR_ICInitStruct->TMR_ICFilter));

    if((TMRx == TMR1) || (TMRx == TMR2) ||
#if !defined (AT32F415xx)
     (TMRx == TMR8) ||
#endif
#if defined (AT32F403xx)
     (TMRx == TMR15) ||
#endif

