RT-Thread/rt-thread/bsp/at32/Libraries/AT32_Std_Driver/AT32F4xx_StdPeriph_Driver/src/at32f4xx_tim.c
     (TMRx == TMR3) || (TMRx == TMR4) || (TMRx == TMR5))
  {
    assert_param(IS_TMR_IC_POLARITY(TMR_ICInitStruct->TMR_ICPolarity));
  }
  else
  {
    assert_param(IS_TMR_IC_POLARITY_LITE(TMR_ICInitStruct->TMR_ICPolarity));
  }

  if (TMR_ICInitStruct->TMR_Channel == TMR_Channel_1)
  {
    assert_param(IS_TMR_LIST8_PERIPH(TMRx));
    /* TI1 Configuration */
    TI1_Config(TMRx, TMR_ICInitStruct->TMR_ICPolarity,
               TMR_ICInitStruct->TMR_ICSelection,
               TMR_ICInitStruct->TMR_ICFilter);
    /* Set the Input Capture Prescaler value */
    TMR_SetIC1DIV(TMRx, TMR_ICInitStruct->TMR_ICDIV);
  }
  else if (TMR_ICInitStruct->TMR_Channel == TMR_Channel_2)
  {
    assert_param(IS_TMR_LIST6_PERIPH(TMRx));
    /* TI2 Configuration */
    TI2_Config(TMRx, TMR_ICInitStruct->TMR_ICPolarity,
               TMR_ICInitStruct->TMR_ICSelection,
               TMR_ICInitStruct->TMR_ICFilter);
    /* Set the Input Capture Prescaler value */
    TMR_SetIC2DIV(TMRx, TMR_ICInitStruct->TMR_ICDIV);
  }
  else if (TMR_ICInitStruct->TMR_Channel == TMR_Channel_3)
  {
    assert_param(IS_TMR_LIST3_PERIPH(TMRx));
    /* TI3 Configuration */
    TI3_Config(TMRx,  TMR_ICInitStruct->TMR_ICPolarity,
               TMR_ICInitStruct->TMR_ICSelection,
               TMR_ICInitStruct->TMR_ICFilter);
    /* Set the Input Capture Prescaler value */
    TMR_SetIC3DIV(TMRx, TMR_ICInitStruct->TMR_ICDIV);
  }
  else
  {
    assert_param(IS_TMR_LIST3_PERIPH(TMRx));
    /* TI4 Configuration */
    TI4_Config(TMRx, TMR_ICInitStruct->TMR_ICPolarity,
               TMR_ICInitStruct->TMR_ICSelection,
               TMR_ICInitStruct->TMR_ICFilter);
    /* Set the Input Capture Prescaler value */
    TMR_SetIC4DIV(TMRx, TMR_ICInitStruct->TMR_ICDIV);
  }
}

/**
  * @brief  Configures the TMR peripheral according to the specified
  *         parameters in the TMR_ICInitStruct to measure an external PWM signal.
  * @param  TMRx: where x can be  1, 2, 3, 4, 5, 8, 9, 12 or 15 to select the TMR peripheral.
  * @param  TMR_ICInitStruct: pointer to a TMR_ICInitType structure
  *         that contains the configuration information for the specified TMR peripheral.
  * @retval None
  */
void TMR_PWMIConfig(TMR_Type* TMRx, TMR_ICInitType* TMR_ICInitStruct)
{
  uint16_t icoppositepolarity = TMR_ICPolarity_Rising;
  uint16_t icoppositeselection = TMR_ICSelection_DirectTI;
  /* Check the parameters */
  assert_param(IS_TMR_LIST6_PERIPH(TMRx));

  /* Select the Opposite Input Polarity */
  if (TMR_ICInitStruct->TMR_ICPolarity == TMR_ICPolarity_Rising)
  {
    icoppositepolarity = TMR_ICPolarity_Falling;
  }
  else
  {
    icoppositepolarity = TMR_ICPolarity_Rising;
  }

  /* Select the Opposite Input */
  if (TMR_ICInitStruct->TMR_ICSelection == TMR_ICSelection_DirectTI)
  {
    icoppositeselection = TMR_ICSelection_IndirectTI;
  }
  else
  {
    icoppositeselection = TMR_ICSelection_DirectTI;
  }

  if (TMR_ICInitStruct->TMR_Channel == TMR_Channel_1)
  {
    /* TI1 Configuration */
    TI1_Config(TMRx, TMR_ICInitStruct->TMR_ICPolarity, TMR_ICInitStruct->TMR_ICSelection,
               TMR_ICInitStruct->TMR_ICFilter);
    /* Set the Input Capture Prescaler value */
    TMR_SetIC1DIV(TMRx, TMR_ICInitStruct->TMR_ICDIV);
    /* TI2 Configuration */
    TI2_Config(TMRx, icoppositepolarity, icoppositeselection, TMR_ICInitStruct->TMR_ICFilter);
    /* Set the Input Capture Prescaler value */
    TMR_SetIC2DIV(TMRx, TMR_ICInitStruct->TMR_ICDIV);
  }
  else
  {
    /* TI2 Configuration */
    TI2_Config(TMRx, TMR_ICInitStruct->TMR_ICPolarity, TMR_ICInitStruct->TMR_ICSelection,
               TMR_ICInitStruct->TMR_ICFilter);
    /* Set the Input Capture Prescaler value */
    TMR_SetIC2DIV(TMRx, TMR_ICInitStruct->TMR_ICDIV);
    /* TI1 Configuration */
    TI1_Config(TMRx, icoppositepolarity, icoppositeselection, TMR_ICInitStruct->TMR_ICFilter);
    /* Set the Input Capture Prescaler value */
    TMR_SetIC1DIV(TMRx, TMR_ICInitStruct->TMR_ICDIV);
  }
}

/**
  * @brief  Configures the: Break feature, dead time, Lock level, the OSSI,
  *         the OSSR State and the AOE(automatic output enable).
  * @param  TMRx: where x can be  1 or 8 to select the TMR
  * @param  TMR_BDTRInitStruct: pointer to a TMR_BRKDTInitType structure that
  *         contains the BDTR Register configuration  information for the TMR peripheral.
  * @retval None
  */
void TMR_BRKDTConfig(TMR_Type* TMRx, TMR_BRKDTInitType *TMR_BDTRInitStruct)
{
  /* Check the parameters */
  assert_param(IS_TMR_LIST2_PERIPH(TMRx));
  assert_param(IS_TMR_OSIMR_STATE(TMR_BDTRInitStruct->TMR_OSIMRState));
  assert_param(IS_TMR_OSIMI_STATE(TMR_BDTRInitStruct->TMR_OSIMIState));
  assert_param(IS_TMR_LOCK_grade(TMR_BDTRInitStruct->TMR_LOCKgrade));
  assert_param(IS_TMR_BREAK_STATE(TMR_BDTRInitStruct->TMR_Break));
  assert_param(IS_TMR_BREAK_POLARITY(TMR_BDTRInitStruct->TMR_BreakPolarity));
  assert_param(IS_TMR_AUTOMATIC_OUTPUT_STATE(TMR_BDTRInitStruct->TMR_AutomaticOutput));
  /* Set the Lock level, the Break enable Bit and the Ploarity, the OSSR State,
     the OSSI State, the dead time value and the Automatic Output Enable Bit */
  TMRx->BRKDT = (uint32_t)TMR_BDTRInitStruct->TMR_OSIMRState | TMR_BDTRInitStruct->TMR_OSIMIState |
                TMR_BDTRInitStruct->TMR_LOCKgrade | TMR_BDTRInitStruct->TMR_DeadTime |
                TMR_BDTRInitStruct->TMR_Break | TMR_BDTRInitStruct->TMR_BreakPolarity |
                TMR_BDTRInitStruct->TMR_AutomaticOutput;
}

/**
  * @brief  Fills each TMR_TimeBaseInitStruct member with its default value.
  * @param  TMR_TimeBaseInitStruct : pointer to a TMR_TimerBaseInitType
  *         structure which will be initialized.
  * @retval None
  */
void TMR_TimeBaseStructInit(TMR_TimerBaseInitType* TMR_TimeBaseInitStruct)
{
  /* Set the default configuration */
  TMR_TimeBaseInitStruct->TMR_Period = 0xFFFF;
  TMR_TimeBaseInitStruct->TMR_DIV = 0x0000;
  TMR_TimeBaseInitStruct->TMR_ClockDivision = TMR_CKD_DIV1;
  TMR_TimeBaseInitStruct->TMR_CounterMode = TMR_CounterDIR_Up;
  TMR_TimeBaseInitStruct->TMR_RepetitionCounter = 0x0000;
}

/**
  * @brief  Fills each TMR_OCInitStruct member with its default value.
  * @param  TMR_OCInitStruct : pointer to a TMR_OCInitType structure which will
  *         be initialized.
  * @retval None
  */
void TMR_OCStructInit(TMR_OCInitType* TMR_OCInitStruct)
{
  /* Set the default configuration */
  TMR_OCInitStruct->TMR_OCMode = TMR_OCMode_Timing;
  TMR_OCInitStruct->TMR_OutputState = TMR_OutputState_Disable;
  TMR_OCInitStruct->TMR_OutputNState = TMR_OutputNState_Disable;
  TMR_OCInitStruct->TMR_Pulse = 0x0000;
  TMR_OCInitStruct->TMR_OCPolarity = TMR_OCPolarity_High;
  TMR_OCInitStruct->TMR_OCNPolarity = TMR_OCPolarity_High;
  TMR_OCInitStruct->TMR_OCIdleState = TMR_OCIdleState_Reset;
  TMR_OCInitStruct->TMR_OCNIdleState = TMR_OCNIdleState_Reset;
}

/**
  * @brief  Fills each TMR_ICInitStruct member with its default value.
  * @param  TMR_ICInitStruct: pointer to a TMR_ICInitType structure which will
  *         be initialized.
  * @retval None
  */
void TMR_ICStructInit(TMR_ICInitType* TMR_ICInitStruct)
{
  /* Set the default configuration */
  TMR_ICInitStruct->TMR_Channel = TMR_Channel_1;
  TMR_ICInitStruct->TMR_ICPolarity = TMR_ICPolarity_Rising;
  TMR_ICInitStruct->TMR_ICSelection = TMR_ICSelection_DirectTI;
  TMR_ICInitStruct->TMR_ICDIV = TMR_ICDIV_DIV1;
  TMR_ICInitStruct->TMR_ICFilter = 0x00;
}

/**
  * @brief  Fills each TMR_BDTRInitStruct member with its default value.
  * @param  TMR_BDTRInitStruct: pointer to a TMR_BRKDTInitType structure which
  *         will be initialized.
  * @retval None
  */
void TMR_BRKDTStructInit(TMR_BRKDTInitType* TMR_BDTRInitStruct)
{
  /* Set the default configuration */
  TMR_BDTRInitStruct->TMR_OSIMRState = TMR_OSIMRState_Disable;
  TMR_BDTRInitStruct->TMR_OSIMIState = TMR_OSIMIState_Disable;
  TMR_BDTRInitStruct->TMR_LOCKgrade = TMR_LOCKgrade_OFF;
  TMR_BDTRInitStruct->TMR_DeadTime = 0x00;
  TMR_BDTRInitStruct->TMR_Break = TMR_Break_Disable;
  TMR_BDTRInitStruct->TMR_BreakPolarity = TMR_BreakPolarity_Low;
  TMR_BDTRInitStruct->TMR_AutomaticOutput = TMR_AutomaticOutput_Disable;
}

/**
  * @brief  Enables or disables the specified TMR peripheral.
  * @param  TMRx: where x can be 1 to 15 to select the TMRx peripheral.
  * @param  NewState: new state of the TMRx peripheral.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void TMR_Cmd(TMR_Type* TMRx, FunctionalState NewState)
{
  /* Check the parameters */
  assert_param(IS_TMR_ALL_PERIPH(TMRx));
  assert_param(IS_FUNCTIONAL_STATE(NewState));

  if (NewState != DISABLE)
  {
    /* Enable the TMR Counter */
    TMRx->CTRL1 |= TMR_CTRL1_CNTEN;
  }
  else
  {
    /* Disable the TMR Counter */
    TMRx->CTRL1 &= (uint16_t)(~((uint16_t)TMR_CTRL1_CNTEN));
  }
}

/**
  * @brief  Enables or disables the TMR peripheral Main Outputs.
  * @param  TMRx: where x can be 1, 8, 15 to select the TMRx peripheral.
  * @param  NewState: new state of the TMR peripheral Main Outputs.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void TMR_CtrlPWMOutputs(TMR_Type* TMRx, FunctionalState NewState)
{
  /* Check the parameters */
  assert_param(IS_TMR_LIST2_PERIPH(TMRx));
  assert_param(IS_FUNCTIONAL_STATE(NewState));

  if (NewState != DISABLE)
  {
    /* Enable the TMR Main Output */
    TMRx->BRKDT |= TMR_BRKDT_MOEN;
  }
  else
  {
    /* Disable the TMR Main Output */
    TMRx->BRKDT &= (uint16_t)(~((uint16_t)TMR_BRKDT_MOEN));
  }
}

/**
  * @brief  Enables or disables the specified TMR interrupts.
  * @param  TMRx: where x can be 1 to 15 to select the TMRx peripheral.
  * @param  TMR_INT: specifies the TMR interrupts sources to be enabled or disabled.
  *   This parameter can be any combination of the following values:
  *     @arg TMR_INT_Overflow: TMR update Interrupt source
  *     @arg TMR_INT_CC1: TMR Capture Compare 1 Interrupt source
  *     @arg TMR_INT_CC2: TMR Capture Compare 2 Interrupt source
  *     @arg TMR_INT_CC3: TMR Capture Compare 3 Interrupt source
  *     @arg TMR_INT_CC4: TMR Capture Compare 4 Interrupt source
  *     @arg TMR_INT_HALL: TMR Commutation Interrupt source
  *     @arg TMR_INT_Trigger: TMR Trigger Interrupt source
  *     @arg TMR_INT_Break: TMR Break Interrupt source
  * @note
  *   - TMR6 and TMR7 can only generate an update interrupt.
  *   - TMR9, TMR12 and TMR15 can have only TMR_INT_Overflow, TMR_INT_CC1,
  *      TMR_INT_CC2 or TMR_INT_Trigger.
  *   - TMR10, TMR11, TMR13, TMR14 can have TMR_INT_Overflow or TMR_INT_CC1.
  *   - TMR_INT_Break is used only with TMR1, TMR8 and TMR15.
  *   - TMR_INT_HALL is used only with TMR1, TMR8, TMR15.
  * @param  NewState: new state of the TMR interrupts.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void TMR_INTConfig(TMR_Type* TMRx, uint16_t TMR_INT, FunctionalState NewState)
{
  /* Check the parameters */
  assert_param(IS_TMR_ALL_PERIPH(TMRx));
  assert_param(IS_TMR_INT(TMR_INT));
  assert_param(IS_FUNCTIONAL_STATE(NewState));

  if (NewState != DISABLE)
  {
    /* Enable the Interrupt sources */
    TMRx->DIE |= TMR_INT;
  }
  else
  {
    /* Disable the Interrupt sources */
    TMRx->DIE &= (uint16_t)~TMR_INT;
  }
}

/**
  * @brief  Configures the TMRx event to be generate by software.
  * @param  TMRx: where x can be 1 to 15 to select the TMR peripheral.
  * @param  TMR_EventSource: specifies the event source.
  *   This parameter can be one or more of the following values:
  *     @arg TMR_EventSource_Update: Timer update Event source
  *     @arg TMR_EventSource_CC1: Timer Capture Compare 1 Event source
  *     @arg TMR_EventSource_CC2: Timer Capture Compare 2 Event source
  *     @arg TMR_EventSource_CC3: Timer Capture Compare 3 Event source
  *     @arg TMR_EventSource_CC4: Timer Capture Compare 4 Event source
  *     @arg TMR_EventSource_HALL: Timer COM event source
  *     @arg TMR_EventSource_Trigger: Timer Trigger Event source
  *     @arg TMR_EventSource_Break: Timer Break event source
  * @note
  *   - TMR6 and TMR7 can only generate an update event.
  *   - TMR_EventSource_HALL and TMR_EventSource_Break are used only with TMR1 and TMR8.
  * @retval None
  */
void TMR_GenerateEvent(TMR_Type* TMRx, uint16_t TMR_EventSource)
{
  /* Check the parameters */
  assert_param(IS_TMR_ALL_PERIPH(TMRx));
  assert_param(IS_TMR_EVENT_SOURCE(TMR_EventSource));

  /* Set the event sources */
  TMRx->EVEG = TMR_EventSource;
}

/**
  * @brief  Configures the TMRx's DMA interface.
  * @param  TMRx: where x can be  1, 2, 3, 4, 5, 8, 15 to select
  *   the TMR peripheral.
  * @param  TMR_DMABase: DMA Base address.
  *   This parameter can be one of the following values:
  *     @arg TMR_DMABase_CTRL1, TMR_DMABase_CTRL2, TMR_DMABase_SMC,
  *          TMR_DMABase_DIE, TMR_DMABase_STS, TMR_DMABase_EVEG,
  *          TMR_DMABase_CCM1, TMR_DMABase_CCM2, TMR_DMABase_CCE,
  *          TMR_DMABase_CNT, TMR_DMABase_DIV, TMR_DMABase_AR,
  *          TMR_DMABase_RC, TMR_DMABase_CC1, TMR_DMABase_CC2,
  *          TMR_DMABase_CC3, TMR_DMABase_CC4, TMR_DMABase_BRKDT,
  *          TMR_DMABase_DMAC.
  * @param  TMR_DMABurstLength: DMA Burst length.
  *   This parameter can be one value between:
  *   TMR_DMABurstLength_1Transfer and TMR_DMABurstLength_18Transfers.
  * @retval None
  */
void TMR_DMAConfig(TMR_Type* TMRx, uint16_t TMR_DMABase, uint16_t TMR_DMABurstLength)
{
  /* Check the parameters */
  assert_param(IS_TMR_LIST4_PERIPH(TMRx));
  assert_param(IS_TMR_DMA_BASE(TMR_DMABase));
  assert_param(IS_TMR_DMA_LENGTH(TMR_DMABurstLength));
  /* Set the DMA Base and the DMA Burst Length */
  TMRx->DMAC = TMR_DMABase | TMR_DMABurstLength;
}

/**
  * @brief  Enables or disables the TMRx's DMA Requests.
  * @param  TMRx: where x can be  1, 2, 3, 4, 5, 6, 7, 8, 15
  *   to select the TMR peripheral.
  * @param  TMR_DMASource: specifies the DMA Request sources.
  *   This parameter can be any combination of the following values:
  *     @arg TMR_DMA_Update: TMR update Interrupt source
  *     @arg TMR_DMA_CC1: TMR Capture Compare 1 DMA source
  *     @arg TMR_DMA_CC2: TMR Capture Compare 2 DMA source
  *     @arg TMR_DMA_CC3: TMR Capture Compare 3 DMA source
  *     @arg TMR_DMA_CC4: TMR Capture Compare 4 DMA source
  *     @arg TMR_DMA_HALL: TMR Commutation DMA source
  *     @arg TMR_DMA_Trigger: TMR Trigger DMA source
  * @param  NewState: new state of the DMA Request sources.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void TMR_DMACmd(TMR_Type* TMRx, uint16_t TMR_DMASource, FunctionalState NewState)
{
  /* Check the parameters */
  assert_param(IS_TMR_LIST9_PERIPH(TMRx));
  assert_param(IS_TMR_DMA_SOURCE(TMR_DMASource));
  assert_param(IS_FUNCTIONAL_STATE(NewState));

  if (NewState != DISABLE)
  {
    /* Enable the DMA sources */
    TMRx->DIE |= TMR_DMASource;
  }
  else
  {
    /* Disable the DMA sources */
    TMRx->DIE &= (uint16_t)~TMR_DMASource;
  }
}

/**
  * @brief  Configures the TMRx internal Clock
  * @param  TMRx: where x can be  1, 2, 3, 4, 5, 8, 9, 12 or 15
  *         to select the TMR peripheral.
  * @retval None
  */
void TMR_InternalClockConfig(TMR_Type* TMRx)
{
  /* Check the parameters */
  assert_param(IS_TMR_LIST6_PERIPH(TMRx));
  /* Disable slave mode to clock the prescaler directly with the internal clock */
  TMRx->SMC &=  (uint16_t)(~((uint16_t)TMR_SMC_SMSEL));
}

/**
  * @brief  Configures the TMRx Internal Trigger as External Clock
  * @param  TMRx: where x can be  1, 2, 3, 4, 5, 9, 12 or 15 to select the TMR peripheral.
  * @param  TMR_ITRSource: Trigger source.
  *   This parameter can be one of the following values:
  * @param  TMR_TRGSEL_ITR0: Internal Trigger 0
  * @param  TMR_TRGSEL_ITR1: Internal Trigger 1
  * @param  TMR_TRGSEL_ITR2: Internal Trigger 2
  * @param  TMR_TRGSEL_ITR3: Internal Trigger 3
  * @retval None
  */
void TMR_ITRxExternalClockConfig(TMR_Type* TMRx, uint16_t TMR_InputTriggerSource)
{
  /* Check the parameters */
  assert_param(IS_TMR_LIST6_PERIPH(TMRx));
  assert_param(IS_TMR_INTERNAL_TRIGGER_SELECTION(TMR_InputTriggerSource));
  /* Select the Internal Trigger */
  TMR_SelectInputTrigger(TMRx, TMR_InputTriggerSource);
  /* Select the External clock mode1 */
  TMRx->SMC |= TMR_SlaveMode_External1;
}

/**
  * @brief  Configures the TMRx Trigger as External Clock
  * @param  TMRx: where x can be  1, 2, 3, 4, 5, 9, 12 or 15 to select the TMR peripheral.
  * @param  TMR_TIxExternalCLKSource: Trigger source.
  *   This parameter can be one of the following values:
  *     @arg TMR_TIxExternalCLK1Source_TI1ED: TI1 Edge Detector
  *     @arg TMR_TIxExternalCLK1Source_TI1: Filtered Timer Input 1
  *     @arg TMR_TIxExternalCLK1Source_TI2: Filtered Timer Input 2
  * @param  TMR_ICPolarity: specifies the TIx Polarity.
  *   This parameter can be one of the following values:
  *     @arg TMR_ICPolarity_Rising
  *     @arg TMR_ICPolarity_Falling
  * @param  ICFilter : specifies the filter value.
  *   This parameter must be a value between 0x0 and 0xF.
  * @retval None
  */
void TMR_TIxExternalClockConfig(TMR_Type* TMRx, uint16_t TMR_TIxExternalCLKSource,
                                uint16_t TMR_ICPolarity, uint16_t ICFilter)
{
  /* Check the parameters */
  assert_param(IS_TMR_LIST6_PERIPH(TMRx));
  assert_param(IS_TMR_TIXCLK_SOURCE(TMR_TIxExternalCLKSource));
  assert_param(IS_TMR_IC_POLARITY(TMR_ICPolarity));
  assert_param(IS_TMR_IC_FILTER(ICFilter));

