RT-Thread/rt-thread/bsp/at32/Libraries/AT32_Std_Driver/AT32F4xx_StdPeriph_Driver/src/at32f4xx_tim.c
  /* Configure the Timer Input Clock Source */
  if (TMR_TIxExternalCLKSource == TMR_TIxExternalCLK1Source_TI2)
  {
    TI2_Config(TMRx, TMR_ICPolarity, TMR_ICSelection_DirectTI, ICFilter);
  }
  else
  {
    TI1_Config(TMRx, TMR_ICPolarity, TMR_ICSelection_DirectTI, ICFilter);
  }

  /* Select the Trigger source */
  TMR_SelectInputTrigger(TMRx, TMR_TIxExternalCLKSource);
  /* Select the External clock mode1 */
  TMRx->SMC |= TMR_SlaveMode_External1;
}

/**
  * @brief  Configures the External clock Mode1
  * @param  TMRx: where x can be  1, 2, 3, 4, 5 or 8 to select the TMR peripheral.
  * @param  TMR_ExtTRGPrescaler: The external Trigger Prescaler.
  *   This parameter can be one of the following values:
  *     @arg TMR_ExtTRGDIV_OFF: ETRP Prescaler OFF.
  *     @arg TMR_ExtTRGDIV_DIV2: ETRP frequency divided by 2.
  *     @arg TMR_ExtTRGDIV_DIV4: ETRP frequency divided by 4.
  *     @arg TMR_ExtTRGDIV_DIV8: ETRP frequency divided by 8.
  * @param  TMR_ExtTRGPolarity: The external Trigger Polarity.
  *   This parameter can be one of the following values:
  *     @arg TMR_ExtTRGPolarity_Inverted: active low or falling edge active.
  *     @arg TMR_ExtTRGPolarity_NonInverted: active high or rising edge active.
  * @param  ExtTRGFilter: External Trigger Filter.
  *   This parameter must be a value between 0x00 and 0x0F
  * @retval None
  */
void TMR_ETRClockMode1Config(TMR_Type* TMRx, uint16_t TMR_ExtTRGPrescaler, uint16_t TMR_ExtTRGPolarity,
                             uint16_t ExtTRGFilter)
{
  uint16_t tmpsmcr = 0;
  /* Check the parameters */
  assert_param(IS_TMR_LIST3_PERIPH(TMRx));
  assert_param(IS_TMR_EXT_DIV(TMR_ExtTRGPrescaler));
  assert_param(IS_TMR_EXT_POLARITY(TMR_ExtTRGPolarity));
  assert_param(IS_TMR_EXT_FILTER(ExtTRGFilter));
  /* Configure the ETR Clock source */
  TMR_ETRConfig(TMRx, TMR_ExtTRGPrescaler, TMR_ExtTRGPolarity, ExtTRGFilter);

  /* Get the TMRx SMCR register value */
  tmpsmcr = TMRx->SMC;
  /* Reset the SMS Bits */
  tmpsmcr &= (uint16_t)(~((uint16_t)TMR_SMC_SMSEL));
  /* Select the External clock mode1 */
  tmpsmcr |= TMR_SlaveMode_External1;
  /* Select the Trigger selection : ETRF */
  tmpsmcr &= (uint16_t)(~((uint16_t)TMR_SMC_TRGSEL));
  tmpsmcr |= TMR_TRGSEL_ETRF;
  /* Write to TMRx SMCR */
  TMRx->SMC = tmpsmcr;
}

/**
  * @brief  Configures the External clock Mode2
  * @param  TMRx: where x can be  1, 2, 3, 4, 5 or 8 to select the TMR peripheral.
  * @param  TMR_ExtTRGPrescaler: The external Trigger Prescaler.
  *   This parameter can be one of the following values:
  *     @arg TMR_ExtTRGDIV_OFF: ETRP Prescaler OFF.
  *     @arg TMR_ExtTRGDIV_DIV2: ETRP frequency divided by 2.
  *     @arg TMR_ExtTRGDIV_DIV4: ETRP frequency divided by 4.
  *     @arg TMR_ExtTRGDIV_DIV8: ETRP frequency divided by 8.
  * @param  TMR_ExtTRGPolarity: The external Trigger Polarity.
  *   This parameter can be one of the following values:
  *     @arg TMR_ExtTRGPolarity_Inverted: active low or falling edge active.
  *     @arg TMR_ExtTRGPolarity_NonInverted: active high or rising edge active.
  * @param  ExtTRGFilter: External Trigger Filter.
  *   This parameter must be a value between 0x00 and 0x0F
  * @retval None
  */
void TMR_ETRClockMode2Config(TMR_Type* TMRx, uint16_t TMR_ExtTRGPrescaler,
                             uint16_t TMR_ExtTRGPolarity, uint16_t ExtTRGFilter)
{
  /* Check the parameters */
  assert_param(IS_TMR_LIST3_PERIPH(TMRx));
  assert_param(IS_TMR_EXT_DIV(TMR_ExtTRGPrescaler));
  assert_param(IS_TMR_EXT_POLARITY(TMR_ExtTRGPolarity));
  assert_param(IS_TMR_EXT_FILTER(ExtTRGFilter));
  /* Configure the ETR Clock source */
  TMR_ETRConfig(TMRx, TMR_ExtTRGPrescaler, TMR_ExtTRGPolarity, ExtTRGFilter);
  /* Enable the External clock mode2 */
  TMRx->SMC |= TMR_SMC_ECLKEN;
}

/**
  * @brief  Configures the TMRx External Trigger (ETR).
  * @param  TMRx: where x can be  1, 2, 3, 4, 5 or 8 to select the TMR peripheral.
  * @param  TMR_ExtTRGPrescaler: The external Trigger Prescaler.
  *   This parameter can be one of the following values:
  *     @arg TMR_ExtTRGDIV_OFF: ETRP Prescaler OFF.
  *     @arg TMR_ExtTRGDIV_DIV2: ETRP frequency divided by 2.
  *     @arg TMR_ExtTRGDIV_DIV4: ETRP frequency divided by 4.
  *     @arg TMR_ExtTRGDIV_DIV8: ETRP frequency divided by 8.
  * @param  TMR_ExtTRGPolarity: The external Trigger Polarity.
  *   This parameter can be one of the following values:
  *     @arg TMR_ExtTRGPolarity_Inverted: active low or falling edge active.
  *     @arg TMR_ExtTRGPolarity_NonInverted: active high or rising edge active.
  * @param  ExtTRGFilter: External Trigger Filter.
  *   This parameter must be a value between 0x00 and 0x0F
  * @retval None
  */
void TMR_ETRConfig(TMR_Type* TMRx, uint16_t TMR_ExtTRGPrescaler, uint16_t TMR_ExtTRGPolarity,
                   uint16_t ExtTRGFilter)
{
  uint16_t tmpsmcr = 0;
  /* Check the parameters */
  assert_param(IS_TMR_LIST3_PERIPH(TMRx));
  assert_param(IS_TMR_EXT_DIV(TMR_ExtTRGPrescaler));
  assert_param(IS_TMR_EXT_POLARITY(TMR_ExtTRGPolarity));
  assert_param(IS_TMR_EXT_FILTER(ExtTRGFilter));
  tmpsmcr = TMRx->SMC;
  /* Reset the ETR Bits */
  tmpsmcr &= SMC_ETR_Mask;
  /* Set the Prescaler, the Filter value and the Polarity */
  tmpsmcr |= (uint16_t)(TMR_ExtTRGPrescaler | (uint16_t)(TMR_ExtTRGPolarity | (uint16_t)(ExtTRGFilter << (uint16_t)8)));
  /* Write to TMRx SMCR */
  TMRx->SMC = tmpsmcr;
}

/**
  * @brief  Configures the TMRx Prescaler.
  * @param  TMRx: where x can be 1 to 15 to select the TMR peripheral.
  * @param  Prescaler: specifies the Prescaler Register value
  * @param  TMR_PSCReloadMode: specifies the TMR Prescaler Reload mode
  *   This parameter can be one of the following values:
  *     @arg TMR_DIVReloadMode_Update: The Prescaler is loaded at the update event.
  *     @arg TMR_DIVReloadMode_Immediate: The Prescaler is loaded immediately.
  * @retval None
  */
void TMR_DIVConfig(TMR_Type* TMRx, uint16_t Prescaler, uint16_t TMR_PSCReloadMode)
{
  /* Check the parameters */
  assert_param(IS_TMR_ALL_PERIPH(TMRx));
  assert_param(IS_TMR_DIV_RELOAD(TMR_PSCReloadMode));
  /* Set the Prescaler value */
  TMRx->DIV = Prescaler;
  /* Set or reset the UG Bit */
  TMRx->EVEG = TMR_PSCReloadMode;
}

/**
  * @brief  Specifies the TMRx Counter Mode to be used.
  * @param  TMRx: where x can be  1, 2, 3, 4, 5 or 8 to select the TMR peripheral.
  * @param  TMR_CounterMode: specifies the Counter Mode to be used
  *   This parameter can be one of the following values:
  *     @arg TMR_CounterDIR_Up: TMR Up Counting Mode
  *     @arg TMR_CounterDIR_Down: TMR Down Counting Mode
  *     @arg TMR_CounterDIR_CenterAligned1: TMR Center Aligned Mode1
  *     @arg TMR_CounterDIR_CenterAligned2: TMR Center Aligned Mode2
  *     @arg TMR_CounterDIR_CenterAligned3: TMR Center Aligned Mode3
  * @retval None
  */
void TMR_CounterModeConfig(TMR_Type* TMRx, uint16_t TMR_CounterMode)
{
  uint16_t tmpcr1 = 0;
  /* Check the parameters */
  assert_param(IS_TMR_LIST3_PERIPH(TMRx));
  assert_param(IS_TMR_COUNTER_DIR(TMR_CounterMode));
  tmpcr1 = TMRx->CTRL1;
  /* Reset the CMS and DIR Bits */
  tmpcr1 &= (uint16_t)(~((uint16_t)(TMR_CTRL1_DIR | TMR_CTRL1_CMSEL)));
  /* Set the Counter Mode */
  tmpcr1 |= TMR_CounterMode;
  /* Write to TMRx CR1 register */
  TMRx->CTRL1 = tmpcr1;
}

/**
  * @brief  Selects the Input Trigger source
  * @param  TMRx: where x can be  1, 2, 3, 4, 5, 8, 9, 12 or 15 to select the TMR peripheral.
  * @param  TMR_InputTriggerSource: The Input Trigger source.
  *   This parameter can be one of the following values:
  *     @arg TMR_TRGSEL_ITR0: Internal Trigger 0
  *     @arg TMR_TRGSEL_ITR1: Internal Trigger 1
  *     @arg TMR_TRGSEL_ITR2: Internal Trigger 2
  *     @arg TMR_TRGSEL_ITR3: Internal Trigger 3
  *     @arg TMR_TRGSEL_TI1F_ED: TI1 Edge Detector
  *     @arg TMR_TRGSEL_TI1FP1: Filtered Timer Input 1
  *     @arg TMR_TRGSEL_TI2FP2: Filtered Timer Input 2
  *     @arg TMR_TRGSEL_ETRF: External Trigger input
  * @retval None
  */
void TMR_SelectInputTrigger(TMR_Type* TMRx, uint16_t TMR_InputTriggerSource)
{
  uint16_t tmpsmcr = 0;
  /* Check the parameters */
  assert_param(IS_TMR_LIST6_PERIPH(TMRx));
  assert_param(IS_TMR_TRIGGER_SELECTION(TMR_InputTriggerSource));
  /* Get the TMRx SMCR register value */
  tmpsmcr = TMRx->SMC;
  /* Reset the TS Bits */
  tmpsmcr &= (uint16_t)(~((uint16_t)TMR_SMC_TRGSEL));
  /* Set the Input Trigger source */
  tmpsmcr |= TMR_InputTriggerSource;
  /* Write to TMRx SMCR */
  TMRx->SMC = tmpsmcr;
}

/**
  * @brief  Configures the TMRx Encoder Interface.
  * @param  TMRx: where x can be  1, 2, 3, 4, 5 or 8 to select the TMR peripheral.
  * @param  TMR_EncoderMode: specifies the TMRx Encoder Mode.
  *   This parameter can be one of the following values:
  *     @arg TMR_EncoderMode_TI1: Counter counts on TI1FP1 edge depending on TI2FP2 level.
  *     @arg TMR_EncoderMode_TI2: Counter counts on TI2FP2 edge depending on TI1FP1 level.
  *     @arg TMR_EncoderMode_TI12: Counter counts on both TI1FP1 and TI2FP2 edges depending
  *                                on the level of the other input.
  * @param  TMR_IC1Polarity: specifies the IC1 Polarity
  *   This parameter can be one of the following values:
  *     @arg TMR_ICPolarity_Falling: IC Falling edge.
  *     @arg TMR_ICPolarity_Rising: IC Rising edge.
  * @param  TMR_IC2Polarity: specifies the IC2 Polarity
  *   This parameter can be one of the following values:
  *     @arg TMR_ICPolarity_Falling: IC Falling edge.
  *     @arg TMR_ICPolarity_Rising: IC Rising edge.
  * @retval None
  */
void TMR_EncoderInterfaceConfig(TMR_Type* TMRx, uint16_t TMR_EncoderMode,
                                uint16_t TMR_IC1Polarity, uint16_t TMR_IC2Polarity)
{
  uint16_t tmpsmcr = 0;
  uint16_t tmpccmr1 = 0;
  uint16_t tmpccer = 0;

  /* Check the parameters */
  assert_param(IS_TMR_LIST5_PERIPH(TMRx));
  assert_param(IS_TMR_ENCODER_MODE(TMR_EncoderMode));
  assert_param(IS_TMR_IC_POLARITY(TMR_IC1Polarity));
  assert_param(IS_TMR_IC_POLARITY(TMR_IC2Polarity));

  /* Get the TMRx SMCR register value */
  tmpsmcr = TMRx->SMC;

  /* Get the TMRx CCMR1 register value */
  tmpccmr1 = TMRx->CCM1;

  /* Get the TMRx CCE register value */
  tmpccer = TMRx->CCE;

  /* Set the encoder Mode */
  tmpsmcr &= (uint16_t)(~((uint16_t)TMR_SMC_SMSEL));
  tmpsmcr |= TMR_EncoderMode;

