RT-Thread/rt-thread/bsp/at32/Libraries/AT32_Std_Driver/AT32F4xx_StdPeriph_Driver/src/at32f4xx_tim.c
  /* Select the Capture Compare 1 and the Capture Compare 2 as input */
  tmpccmr1 &= (uint16_t)(((uint16_t)~((uint16_t)TMR_CCM1_C1SEL)) & (uint16_t)(~((uint16_t)TMR_CCM1_C2SEL)));
  tmpccmr1 |= TMR_CCM1_C1SEL_0 | TMR_CCM1_C2SEL_0;

  /* Set the TI1 and the TI2 Polarities */
  tmpccer &= (uint16_t)(((uint16_t)~((uint16_t)TMR_CCE_C1P)) & ((uint16_t)~((uint16_t)TMR_CCE_C2P)));
  tmpccer |= (uint16_t)(TMR_IC1Polarity | (uint16_t)(TMR_IC2Polarity << (uint16_t)4));

  /* Write to TMRx SMCR */
  TMRx->SMC = tmpsmcr;
  /* Write to TMRx CCMR1 */
  TMRx->CCM1 = tmpccmr1;
  /* Write to TMRx CCE */
  TMRx->CCE = tmpccer;
}

/**
  * @brief  Forces the TMRx output 1 waveform to active or inactive level.
  * @param  TMRx: where x can be  1 to 15 except 6 and 7 to select the TMR peripheral.
  * @param  TMR_ForcedAction: specifies the forced Action to be set to the output waveform.
  *   This parameter can be one of the following values:
  *     @arg TMR_ForcedAction_Active: Force active level on OC1REF
  *     @arg TMR_ForcedAction_InActive: Force inactive level on OC1REF.
  * @retval None
  */
void TMR_ForcedOC1Config(TMR_Type* TMRx, uint16_t TMR_ForcedAction)
{
  uint16_t tmpccmr1 = 0;
  /* Check the parameters */
  assert_param(IS_TMR_LIST8_PERIPH(TMRx));
  assert_param(IS_TMR_FORCED_ACTION(TMR_ForcedAction));
  tmpccmr1 = TMRx->CCM1;
  /* Reset the OC1M Bits */
  tmpccmr1 &= (uint16_t)~((uint16_t)TMR_CCM1_OC1MODE);
  /* Configure The Forced output Mode */
  tmpccmr1 |= TMR_ForcedAction;
  /* Write to TMRx CCMR1 register */
  TMRx->CCM1 = tmpccmr1;
}

/**
  * @brief  Forces the TMRx output 2 waveform to active or inactive level.
  * @param  TMRx: where x can be  1, 2, 3, 4, 5, 8, 9, 12 or 15 to select the TMR peripheral.
  * @param  TMR_ForcedAction: specifies the forced Action to be set to the output waveform.
  *   This parameter can be one of the following values:
  *     @arg TMR_ForcedAction_Active: Force active level on OC2REF
  *     @arg TMR_ForcedAction_InActive: Force inactive level on OC2REF.
  * @retval None
  */
void TMR_ForcedOC2Config(TMR_Type* TMRx, uint16_t TMR_ForcedAction)
{
  uint16_t tmpccmr1 = 0;
  /* Check the parameters */
  assert_param(IS_TMR_LIST6_PERIPH(TMRx));
  assert_param(IS_TMR_FORCED_ACTION(TMR_ForcedAction));
  tmpccmr1 = TMRx->CCM1;
  /* Reset the OC2M Bits */
  tmpccmr1 &= (uint16_t)~((uint16_t)TMR_CCM1_OC2MODE);
  /* Configure The Forced output Mode */
  tmpccmr1 |= (uint16_t)(TMR_ForcedAction << 8);
  /* Write to TMRx CCMR1 register */
  TMRx->CCM1 = tmpccmr1;
}

/**
  * @brief  Forces the TMRx output 3 waveform to active or inactive level.
  * @param  TMRx: where x can be  1, 2, 3, 4, 5 or 8 to select the TMR peripheral.
  * @param  TMR_ForcedAction: specifies the forced Action to be set to the output waveform.
  *   This parameter can be one of the following values:
  *     @arg TMR_ForcedAction_Active: Force active level on OC3REF
  *     @arg TMR_ForcedAction_InActive: Force inactive level on OC3REF.
  * @retval None
  */
void TMR_ForcedOC3Config(TMR_Type* TMRx, uint16_t TMR_ForcedAction)
{
  uint16_t tmpccmr2 = 0;
  /* Check the parameters */
  assert_param(IS_TMR_LIST3_PERIPH(TMRx));
  assert_param(IS_TMR_FORCED_ACTION(TMR_ForcedAction));
  tmpccmr2 = TMRx->CCM2;
  /* Reset the OC1M Bits */
  tmpccmr2 &= (uint16_t)~((uint16_t)TMR_CCM2_OC3MODE);
  /* Configure The Forced output Mode */
  tmpccmr2 |= TMR_ForcedAction;
  /* Write to TMRx CCMR2 register */
  TMRx->CCM2 = tmpccmr2;
}

/**
  * @brief  Forces the TMRx output 4 waveform to active or inactive level.
  * @param  TMRx: where x can be  1, 2, 3, 4, 5 or 8 to select the TMR peripheral.
  * @param  TMR_ForcedAction: specifies the forced Action to be set to the output waveform.
  *   This parameter can be one of the following values:
  *     @arg TMR_ForcedAction_Active: Force active level on OC4REF
  *     @arg TMR_ForcedAction_InActive: Force inactive level on OC4REF.
  * @retval None
  */
void TMR_ForcedOC4Config(TMR_Type* TMRx, uint16_t TMR_ForcedAction)
{
  uint16_t tmpccmr2 = 0;
  /* Check the parameters */
  assert_param(IS_TMR_LIST3_PERIPH(TMRx));
  assert_param(IS_TMR_FORCED_ACTION(TMR_ForcedAction));
  tmpccmr2 = TMRx->CCM2;
  /* Reset the OC2M Bits */
  tmpccmr2 &= (uint16_t)~((uint16_t)TMR_CCM2_OC4MODE);
  /* Configure The Forced output Mode */
  tmpccmr2 |= (uint16_t)(TMR_ForcedAction << 8);
  /* Write to TMRx CCMR2 register */
  TMRx->CCM2 = tmpccmr2;
}

/**
  * @brief  Enables or disables TMRx peripheral Preload register on ARR.
  * @param  TMRx: where x can be  1 to 15 to select the TMR peripheral.
  * @param  NewState: new state of the TMRx peripheral Preload register
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void TMR_ARPreloadConfig(TMR_Type* TMRx, FunctionalState NewState)
{
  /* Check the parameters */
  assert_param(IS_TMR_ALL_PERIPH(TMRx));
  assert_param(IS_FUNCTIONAL_STATE(NewState));

  if (NewState != DISABLE)
  {
    /* Set the ARR Preload Bit */
    TMRx->CTRL1 |= TMR_CTRL1_ARPEN;
  }
  else
  {
    /* Reset the ARR Preload Bit */
    TMRx->CTRL1 &= (uint16_t)~((uint16_t)TMR_CTRL1_ARPEN);
  }
}

/**
  * @brief  Selects the TMR peripheral Commutation event.
  * @param  TMRx: where x can be  1, 8, 15 to select the TMRx peripheral
  * @param  NewState: new state of the Commutation event.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void TMR_SelectHALL(TMR_Type* TMRx, FunctionalState NewState)
{
  /* Check the parameters */
  assert_param(IS_TMR_LIST2_PERIPH(TMRx));
  assert_param(IS_FUNCTIONAL_STATE(NewState));

  if (NewState != DISABLE)
  {
    /* Set the COM Bit */
    TMRx->CTRL2 |= TMR_CTRL2_CUSEL;
  }
  else
  {
    /* Reset the COM Bit */
    TMRx->CTRL2 &= (uint16_t)~((uint16_t)TMR_CTRL2_CUSEL);
  }
}

/**
  * @brief  Selects the TMRx peripheral Capture Compare DMA source.
  * @param  TMRx: where x can be  1, 2, 3, 4, 5, 8, 15 to select
  *         the TMR peripheral.
  * @param  NewState: new state of the Capture Compare DMA source
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void TMR_SelectCCDMA(TMR_Type* TMRx, FunctionalState NewState)
{
  /* Check the parameters */
  assert_param(IS_TMR_LIST4_PERIPH(TMRx));
  assert_param(IS_FUNCTIONAL_STATE(NewState));

  if (NewState != DISABLE)
  {
    /* Set the CCDS Bit */
    TMRx->CTRL2 |= TMR_CTRL2_CDSEL;
  }
  else
  {
    /* Reset the CCDS Bit */
    TMRx->CTRL2 &= (uint16_t)~((uint16_t)TMR_CTRL2_CDSEL);
  }
}

/**
  * @brief  Sets or Resets the TMR peripheral Capture Compare Preload Control bit.
  * @param  TMRx: where x can be   1, 2, 3, 4, 5, 8 or 15
  *         to select the TMRx peripheral
  * @param  NewState: new state of the Capture Compare Preload Control bit
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void TMR_CCPreloadControl(TMR_Type* TMRx, FunctionalState NewState)
{
  /* Check the parameters */
  assert_param(IS_TMR_LIST5_PERIPH(TMRx));
  assert_param(IS_FUNCTIONAL_STATE(NewState));

  if (NewState != DISABLE)
  {
    /* Set the CCPC Bit */
    TMRx->CTRL2 |= TMR_CTRL2_CPC;
  }
  else
  {
    /* Reset the CCPC Bit */
    TMRx->CTRL2 &= (uint16_t)~((uint16_t)TMR_CTRL2_CPC);
  }
}

/**
  * @brief  Enables or disables the TMRx peripheral Preload register on CCR1.
  * @param  TMRx: where x can be  1 to 15 except 6 and 7 to select the TMR peripheral.
  * @param  TMR_OCPreload: new state of the TMRx peripheral Preload register
  *   This parameter can be one of the following values:
  *     @arg TMR_OCPreload_Enable
  *     @arg TMR_OCPreload_Disable
  * @retval None
  */
void TMR_OC1PreloadConfig(TMR_Type* TMRx, uint16_t TMR_OCPreload)
{
  uint16_t tmpccmr1 = 0;
  /* Check the parameters */
  assert_param(IS_TMR_LIST8_PERIPH(TMRx));
  assert_param(IS_TMR_OCPRELOAD_STATE(TMR_OCPreload));
  tmpccmr1 = TMRx->CCM1;
  /* Reset the OC1PE Bit */
  tmpccmr1 &= (uint16_t)~((uint16_t)TMR_CCM1_OC1PEN);
  /* Enable or Disable the Output Compare Preload feature */
  tmpccmr1 |= TMR_OCPreload;
  /* Write to TMRx CCMR1 register */
  TMRx->CCM1 = tmpccmr1;
}

/**
  * @brief  Enables or disables the TMRx peripheral Preload register on CCR2.
  * @param  TMRx: where x can be  1, 2, 3, 4, 5, 8, 9, 12 or 15 to select
  *         the TMR peripheral.
  * @param  TMR_OCPreload: new state of the TMRx peripheral Preload register
  *   This parameter can be one of the following values:
  *     @arg TMR_OCPreload_Enable
  *     @arg TMR_OCPreload_Disable
  * @retval None
  */
void TMR_OC2PreloadConfig(TMR_Type* TMRx, uint16_t TMR_OCPreload)
{
  uint16_t tmpccmr1 = 0;
  /* Check the parameters */
  assert_param(IS_TMR_LIST6_PERIPH(TMRx));
  assert_param(IS_TMR_OCPRELOAD_STATE(TMR_OCPreload));
  tmpccmr1 = TMRx->CCM1;
  /* Reset the OC2PE Bit */
  tmpccmr1 &= (uint16_t)~((uint16_t)TMR_CCM1_OC2PEN);
  /* Enable or Disable the Output Compare Preload feature */
  tmpccmr1 |= (uint16_t)(TMR_OCPreload << 8);
  /* Write to TMRx CCMR1 register */
  TMRx->CCM1 = tmpccmr1;
}

/**
  * @brief  Enables or disables the TMRx peripheral Preload register on CCR3.
  * @param  TMRx: where x can be  1, 2, 3, 4, 5 or 8 to select the TMR peripheral.
  * @param  TMR_OCPreload: new state of the TMRx peripheral Preload register
  *   This parameter can be one of the following values:
  *     @arg TMR_OCPreload_Enable
  *     @arg TMR_OCPreload_Disable
  * @retval None
  */
void TMR_OC3PreloadConfig(TMR_Type* TMRx, uint16_t TMR_OCPreload)
{
  uint16_t tmpccmr2 = 0;
  /* Check the parameters */
  assert_param(IS_TMR_LIST3_PERIPH(TMRx));
  assert_param(IS_TMR_OCPRELOAD_STATE(TMR_OCPreload));
  tmpccmr2 = TMRx->CCM2;
  /* Reset the OC3PE Bit */
  tmpccmr2 &= (uint16_t)~((uint16_t)TMR_CCM2_OC3PEN);
  /* Enable or Disable the Output Compare Preload feature */
  tmpccmr2 |= TMR_OCPreload;
  /* Write to TMRx CCMR2 register */
  TMRx->CCM2 = tmpccmr2;
}

/**
  * @brief  Enables or disables the TMRx peripheral Preload register on CCR4.
  * @param  TMRx: where x can be  1, 2, 3, 4, 5 or 8 to select the TMR peripheral.
  * @param  TMR_OCPreload: new state of the TMRx peripheral Preload register
  *   This parameter can be one of the following values:
  *     @arg TMR_OCPreload_Enable
  *     @arg TMR_OCPreload_Disable
  * @retval None
  */
void TMR_OC4PreloadConfig(TMR_Type* TMRx, uint16_t TMR_OCPreload)
{
  uint16_t tmpccmr2 = 0;
  /* Check the parameters */
  assert_param(IS_TMR_LIST3_PERIPH(TMRx));
  assert_param(IS_TMR_OCPRELOAD_STATE(TMR_OCPreload));
  tmpccmr2 = TMRx->CCM2;
  /* Reset the OC4PE Bit */
  tmpccmr2 &= (uint16_t)~((uint16_t)TMR_CCM2_OC4PE);
  /* Enable or Disable the Output Compare Preload feature */
  tmpccmr2 |= (uint16_t)(TMR_OCPreload << 8);
  /* Write to TMRx CCMR2 register */
  TMRx->CCM2 = tmpccmr2;
}

/**
  * @brief  Configures the TMRx Output Compare 1 Fast feature.
  * @param  TMRx: where x can be  1 to 15 except 6 and 7 to select the TMR peripheral.
  * @param  TMR_OCFast: new state of the Output Compare Fast Enable Bit.
  *   This parameter can be one of the following values:
  *     @arg TMR_OCFast_Enable: TMR output compare fast enable
  *     @arg TMR_OCFast_Disable: TMR output compare fast disable
  * @retval None
  */
void TMR_OC1FastConfig(TMR_Type* TMRx, uint16_t TMR_OCFast)
{
  uint16_t tmpccmr1 = 0;
  /* Check the parameters */
  assert_param(IS_TMR_LIST8_PERIPH(TMRx));
  assert_param(IS_TMR_OCFAST_STATE(TMR_OCFast));
  /* Get the TMRx CCMR1 register value */
  tmpccmr1 = TMRx->CCM1;
  /* Reset the OC1FE Bit */
  tmpccmr1 &= (uint16_t)~((uint16_t)TMR_CCM1_OC1FEN);
  /* Enable or Disable the Output Compare Fast Bit */
  tmpccmr1 |= TMR_OCFast;
  /* Write to TMRx CCMR1 */
  TMRx->CCM1 = tmpccmr1;
}

/**
  * @brief  Configures the TMRx Output Compare 2 Fast feature.
  * @param  TMRx: where x can be  1, 2, 3, 4, 5, 8, 9, 12 or 15 to select
  *         the TMR peripheral.
  * @param  TMR_OCFast: new state of the Output Compare Fast Enable Bit.
  *   This parameter can be one of the following values:
  *     @arg TMR_OCFast_Enable: TMR output compare fast enable
  *     @arg TMR_OCFast_Disable: TMR output compare fast disable
  * @retval None
  */
void TMR_OC2FastConfig(TMR_Type* TMRx, uint16_t TMR_OCFast)
{
  uint16_t tmpccmr1 = 0;
  /* Check the parameters */
  assert_param(IS_TMR_LIST6_PERIPH(TMRx));
  assert_param(IS_TMR_OCFAST_STATE(TMR_OCFast));
  /* Get the TMRx CCMR1 register value */
  tmpccmr1 = TMRx->CCM1;
  /* Reset the OC2FE Bit */
  tmpccmr1 &= (uint16_t)~((uint16_t)TMR_CCM1_OC2FNE);
  /* Enable or Disable the Output Compare Fast Bit */
  tmpccmr1 |= (uint16_t)(TMR_OCFast << 8);
  /* Write to TMRx CCMR1 */
  TMRx->CCM1 = tmpccmr1;
}

/**
  * @brief  Configures the TMRx Output Compare 3 Fast feature.
  * @param  TMRx: where x can be  1, 2, 3, 4, 5 or 8 to select the TMR peripheral.
  * @param  TMR_OCFast: new state of the Output Compare Fast Enable Bit.
  *   This parameter can be one of the following values:
  *     @arg TMR_OCFast_Enable: TMR output compare fast enable
  *     @arg TMR_OCFast_Disable: TMR output compare fast disable
  * @retval None
  */
void TMR_OC3FastConfig(TMR_Type* TMRx, uint16_t TMR_OCFast)
{
  uint16_t tmpccmr2 = 0;
  /* Check the parameters */
  assert_param(IS_TMR_LIST3_PERIPH(TMRx));
  assert_param(IS_TMR_OCFAST_STATE(TMR_OCFast));
  /* Get the TMRx CCMR2 register value */
  tmpccmr2 = TMRx->CCM2;
  /* Reset the OC3FE Bit */
  tmpccmr2 &= (uint16_t)~((uint16_t)TMR_CCM2_OC3FEN);
  /* Enable or Disable the Output Compare Fast Bit */
  tmpccmr2 |= TMR_OCFast;
  /* Write to TMRx CCMR2 */
  TMRx->CCM2 = tmpccmr2;
}

/**
  * @brief  Configures the TMRx Output Compare 4 Fast feature.
  * @param  TMRx: where x can be  1, 2, 3, 4, 5 or 8 to select the TMR peripheral.
  * @param  TMR_OCFast: new state of the Output Compare Fast Enable Bit.
  *   This parameter can be one of the following values:
  *     @arg TMR_OCFast_Enable: TMR output compare fast enable
  *     @arg TMR_OCFast_Disable: TMR output compare fast disable
  * @retval None
  */
void TMR_OC4FastConfig(TMR_Type* TMRx, uint16_t TMR_OCFast)
{
  uint16_t tmpccmr2 = 0;
  /* Check the parameters */
  assert_param(IS_TMR_LIST3_PERIPH(TMRx));
  assert_param(IS_TMR_OCFAST_STATE(TMR_OCFast));
  /* Get the TMRx CCMR2 register value */
  tmpccmr2 = TMRx->CCM2;
  /* Reset the OC4FE Bit */
  tmpccmr2 &= (uint16_t)~((uint16_t)TMR_CCM2_OC4FE);
  /* Enable or Disable the Output Compare Fast Bit */
  tmpccmr2 |= (uint16_t)(TMR_OCFast << 8);
  /* Write to TMRx CCMR2 */
  TMRx->CCM2 = tmpccmr2;
}

/**
  * @brief  Clears or safeguards the OCREF1 signal on an external event
  * @param  TMRx: where x can be  1, 2, 3, 4, 5 or 8 to select the TMR peripheral.
  * @param  TMR_OCClear: new state of the Output Compare Clear Enable Bit.
  *   This parameter can be one of the following values:
  *     @arg TMR_OCClear_Enable: TMR Output clear enable
  *     @arg TMR_OCClear_Disable: TMR Output clear disable
  * @retval None
  */
void TMR_ClearOC1Ref(TMR_Type* TMRx, uint16_t TMR_OCClear)
{
  uint16_t tmpccmr1 = 0;
  /* Check the parameters */
  assert_param(IS_TMR_LIST3_PERIPH(TMRx));
  assert_param(IS_TMR_OCCLEAR_STATE(TMR_OCClear));

  tmpccmr1 = TMRx->CCM1;

  /* Reset the OC1CE Bit */
  tmpccmr1 &= (uint16_t)~((uint16_t)TMR_CCM1_C1CDIS);
  /* Enable or Disable the Output Compare Clear Bit */
  tmpccmr1 |= TMR_OCClear;
  /* Write to TMRx CCMR1 register */
  TMRx->CCM1 = tmpccmr1;
}

/**
  * @brief  Clears or safeguards the OCREF2 signal on an external event
  * @param  TMRx: where x can be  1, 2, 3, 4, 5 or 8 to select the TMR peripheral.
  * @param  TMR_OCClear: new state of the Output Compare Clear Enable Bit.
  *   This parameter can be one of the following values:
  *     @arg TMR_OCClear_Enable: TMR Output clear enable
  *     @arg TMR_OCClear_Disable: TMR Output clear disable
  * @retval None
  */
void TMR_ClearOC2Ref(TMR_Type* TMRx, uint16_t TMR_OCClear)
{
  uint16_t tmpccmr1 = 0;
  /* Check the parameters */
  assert_param(IS_TMR_LIST3_PERIPH(TMRx));
  assert_param(IS_TMR_OCCLEAR_STATE(TMR_OCClear));
  tmpccmr1 = TMRx->CCM1;
  /* Reset the OC2CE Bit */
  tmpccmr1 &= (uint16_t)~((uint16_t)TMR_CCM1_OC2CDIS);
  /* Enable or Disable the Output Compare Clear Bit */
  tmpccmr1 |= (uint16_t)(TMR_OCClear << 8);
  /* Write to TMRx CCMR1 register */
  TMRx->CCM1 = tmpccmr1;
}

/**
  * @brief  Clears or safeguards the OCREF3 signal on an external event
  * @param  TMRx: where x can be  1, 2, 3, 4, 5 or 8 to select the TMR peripheral.
  * @param  TMR_OCClear: new state of the Output Compare Clear Enable Bit.
  *   This parameter can be one of the following values:
  *     @arg TMR_OCClear_Enable: TMR Output clear enable
  *     @arg TMR_OCClear_Disable: TMR Output clear disable
  * @retval None
  */
void TMR_ClearOC3Ref(TMR_Type* TMRx, uint16_t TMR_OCClear)
{
  uint16_t tmpccmr2 = 0;
  /* Check the parameters */
  assert_param(IS_TMR_LIST3_PERIPH(TMRx));
  assert_param(IS_TMR_OCCLEAR_STATE(TMR_OCClear));
  tmpccmr2 = TMRx->CCM2;
  /* Reset the OC3CE Bit */
  tmpccmr2 &= (uint16_t)~((uint16_t)TMR_CCM2_OC3CDIS);
  /* Enable or Disable the Output Compare Clear Bit */
  tmpccmr2 |= TMR_OCClear;
  /* Write to TMRx CCMR2 register */
  TMRx->CCM2 = tmpccmr2;
}

/**
  * @brief  Clears or safeguards the OCREF4 signal on an external event
  * @param  TMRx: where x can be  1, 2, 3, 4, 5 or 8 to select the TMR peripheral.
  * @param  TMR_OCClear: new state of the Output Compare Clear Enable Bit.
  *   This parameter can be one of the following values:
  *     @arg TMR_OCClear_Enable: TMR Output clear enable
  *     @arg TMR_OCClear_Disable: TMR Output clear disable
  * @retval None
  */
void TMR_ClearOC4Ref(TMR_Type* TMRx, uint16_t TMR_OCClear)
{
  uint16_t tmpccmr2 = 0;
  /* Check the parameters */
  assert_param(IS_TMR_LIST3_PERIPH(TMRx));
  assert_param(IS_TMR_OCCLEAR_STATE(TMR_OCClear));
  tmpccmr2 = TMRx->CCM2;
  /* Reset the OC4CE Bit */
  tmpccmr2 &= (uint16_t)~((uint16_t)TMR_CCM2_OC4CDIS);
  /* Enable or Disable the Output Compare Clear Bit */
  tmpccmr2 |= (uint16_t)(TMR_OCClear << 8);
  /* Write to TMRx CCMR2 register */
  TMRx->CCM2 = tmpccmr2;
}

/**
  * @brief  Configures the TMRx channel 1 polarity.
  * @param  TMRx: where x can be 1 to 15 except 6 and 7 to select the TMR peripheral.
  * @param  TMR_OCPolarity: specifies the OC1 Polarity
  *   This parameter can be one of the following values:
  *     @arg TMR_OCPolarity_High: Output Compare active high
  *     @arg TMR_OCPolarity_Low: Output Compare active low
  * @retval None
  */
void TMR_OC1PolarityConfig(TMR_Type* TMRx, uint16_t TMR_OCPolarity)
{
  uint16_t tmpccer = 0;
  /* Check the parameters */
  assert_param(IS_TMR_LIST8_PERIPH(TMRx));
  assert_param(IS_TMR_OC_POLARITY(TMR_OCPolarity));
  tmpccer = TMRx->CCE;
  /* Set or Reset the CC1P Bit */
  tmpccer &= (uint16_t)~((uint16_t)TMR_CCE_C1P);
  tmpccer |= TMR_OCPolarity;
  /* Write to TMRx CCE register */
  TMRx->CCE = tmpccer;
}

/**
  * @brief  Configures the TMRx Channel 1N polarity.
  * @param  TMRx: where x can be 1, 8, 15 to select the TMR peripheral.
  * @param  TMR_OCNPolarity: specifies the OC1N Polarity
  *   This parameter can be one of the following values:
  *     @arg TMR_OCNPolarity_High: Output Compare active high
  *     @arg TMR_OCNPolarity_Low: Output Compare active low
  * @retval None
  */
void TMR_OC1NPolarityConfig(TMR_Type* TMRx, uint16_t TMR_OCNPolarity)
{
  uint16_t tmpccer = 0;
  /* Check the parameters */
  assert_param(IS_TMR_LIST2_PERIPH(TMRx));
  assert_param(IS_TMR_OCN_POLARITY(TMR_OCNPolarity));

