RT-Thread/rt-thread/bsp/at32/Libraries/AT32_Std_Driver/AT32F4xx_StdPeriph_Driver/src/at32f4xx_tim.c
  tmpccer = TMRx->CCE;
  /* Set or Reset the CC1NP Bit */
  tmpccer &= (uint16_t)~((uint16_t)TMR_CCE_C1NP);
  tmpccer |= TMR_OCNPolarity;
  /* Write to TMRx CCE register */
  TMRx->CCE = tmpccer;
}

/**
  * @brief  Configures the TMRx channel 2 polarity.
  * @param  TMRx: where x can be 1, 2, 3, 4, 5, 8, 9, 12 or 15 to select the TMR peripheral.
  * @param  TMR_OCPolarity: specifies the OC2 Polarity
  *   This parameter can be one of the following values:
  *     @arg TMR_OCPolarity_High: Output Compare active high
  *     @arg TMR_OCPolarity_Low: Output Compare active low
  * @retval None
  */
void TMR_OC2PolarityConfig(TMR_Type* TMRx, uint16_t TMR_OCPolarity)
{
  uint16_t tmpccer = 0;
  /* Check the parameters */
  assert_param(IS_TMR_LIST6_PERIPH(TMRx));
  assert_param(IS_TMR_OC_POLARITY(TMR_OCPolarity));
  tmpccer = TMRx->CCE;
  /* Set or Reset the CC2P Bit */
  tmpccer &= (uint16_t)~((uint16_t)TMR_CCE_C2P);
  tmpccer |= (uint16_t)(TMR_OCPolarity << 4);
  /* Write to TMRx CCE register */
  TMRx->CCE = tmpccer;
}

/**
  * @brief  Configures the TMRx Channel 2N polarity.
  * @param  TMRx: where x can be 1 or 8 to select the TMR peripheral.
  * @param  TMR_OCNPolarity: specifies the OC2N Polarity
  *   This parameter can be one of the following values:
  *     @arg TMR_OCNPolarity_High: Output Compare active high
  *     @arg TMR_OCNPolarity_Low: Output Compare active low
  * @retval None
  */
void TMR_OC2NPolarityConfig(TMR_Type* TMRx, uint16_t TMR_OCNPolarity)
{
  uint16_t tmpccer = 0;
  /* Check the parameters */
  assert_param(IS_TMR_LIST1_PERIPH(TMRx));
  assert_param(IS_TMR_OCN_POLARITY(TMR_OCNPolarity));

  tmpccer = TMRx->CCE;
  /* Set or Reset the CC2NP Bit */
  tmpccer &= (uint16_t)~((uint16_t)TMR_CCE_C2NP);
  tmpccer |= (uint16_t)(TMR_OCNPolarity << 4);
  /* Write to TMRx CCE register */
  TMRx->CCE = tmpccer;
}

/**
  * @brief  Configures the TMRx channel 3 polarity.
  * @param  TMRx: where x can be 1, 2, 3, 4, 5 or 8 to select the TMR peripheral.
  * @param  TMR_OCPolarity: specifies the OC3 Polarity
  *   This parameter can be one of the following values:
  *     @arg TMR_OCPolarity_High: Output Compare active high
  *     @arg TMR_OCPolarity_Low: Output Compare active low
  * @retval None
  */
void TMR_OC3PolarityConfig(TMR_Type* TMRx, uint16_t TMR_OCPolarity)
{
  uint16_t tmpccer = 0;
  /* Check the parameters */
  assert_param(IS_TMR_LIST3_PERIPH(TMRx));
  assert_param(IS_TMR_OC_POLARITY(TMR_OCPolarity));
  tmpccer = TMRx->CCE;
  /* Set or Reset the CC3P Bit */
  tmpccer &= (uint16_t)~((uint16_t)TMR_CCE_C3P);
  tmpccer |= (uint16_t)(TMR_OCPolarity << 8);
  /* Write to TMRx CCE register */
  TMRx->CCE = tmpccer;
}

/**
  * @brief  Configures the TMRx Channel 3N polarity.
  * @param  TMRx: where x can be 1 or 8 to select the TMR peripheral.
  * @param  TMR_OCNPolarity: specifies the OC3N Polarity
  *   This parameter can be one of the following values:
  *     @arg TMR_OCNPolarity_High: Output Compare active high
  *     @arg TMR_OCNPolarity_Low: Output Compare active low
  * @retval None
  */
void TMR_OC3NPolarityConfig(TMR_Type* TMRx, uint16_t TMR_OCNPolarity)
{
  uint16_t tmpccer = 0;

  /* Check the parameters */
  assert_param(IS_TMR_LIST1_PERIPH(TMRx));
  assert_param(IS_TMR_OCN_POLARITY(TMR_OCNPolarity));

  tmpccer = TMRx->CCE;
  /* Set or Reset the CC3NP Bit */
  tmpccer &= (uint16_t)~((uint16_t)TMR_CCE_C3NP);
  tmpccer |= (uint16_t)(TMR_OCNPolarity << 8);
  /* Write to TMRx CCER register */
  TMRx->CCE = tmpccer;
}

/**
  * @brief  Configures the TMRx channel 4 polarity.
  * @param  TMRx: where x can be 1, 2, 3, 4, 5 or 8 to select the TMR peripheral.
  * @param  TMR_OCPolarity: specifies the OC4 Polarity
  *   This parameter can be one of the following values:
  *     @arg TMR_OCPolarity_High: Output Compare active high
  *     @arg TMR_OCPolarity_Low: Output Compare active low
  * @retval None
  */
void TMR_OC4PolarityConfig(TMR_Type* TMRx, uint16_t TMR_OCPolarity)
{
  uint16_t tmpccer = 0;
  /* Check the parameters */
  assert_param(IS_TMR_LIST3_PERIPH(TMRx));
  assert_param(IS_TMR_OC_POLARITY(TMR_OCPolarity));
  tmpccer = TMRx->CCE;
  /* Set or Reset the CC4P Bit */
  tmpccer &= (uint16_t)~((uint16_t)TMR_CCE_C4P);
  tmpccer |= (uint16_t)(TMR_OCPolarity << 12);
  /* Write to TMRx CCE register */
  TMRx->CCE = tmpccer;
}

/**
  * @brief  Enables or disables the TMR Capture Compare Channel x.
  * @param  TMRx: where x can be 1 to 15 except 6 and 7 to select the TMR peripheral.
  * @param  TMR_Channel: specifies the TMR Channel
  *   This parameter can be one of the following values:
  *     @arg TMR_Channel_1: TMR Channel 1
  *     @arg TMR_Channel_2: TMR Channel 2
  *     @arg TMR_Channel_3: TMR Channel 3
  *     @arg TMR_Channel_4: TMR Channel 4
  * @param  TMR_CCx: specifies the TMR Channel CCxE bit new state.
  *   This parameter can be: TMR_CCx_Enable or TMR_CCx_Disable.
  * @retval None
  */
void TMR_CCxCmd(TMR_Type* TMRx, uint16_t TMR_Channel, uint16_t TMR_CCx)
{
  uint16_t tmp = 0;

  /* Check the parameters */
  assert_param(IS_TMR_LIST8_PERIPH(TMRx));
  assert_param(IS_TMR_CHANNEL(TMR_Channel));
  assert_param(IS_TMR_CCX(TMR_CCx));

  tmp = CCE_CCE_Set << TMR_Channel;

  /* Reset the CCxE Bit */
  TMRx->CCE &= (uint16_t)~ tmp;

  /* Set or reset the CCxE Bit */
  TMRx->CCE |=  (uint16_t)(TMR_CCx << TMR_Channel);
}

/**
  * @brief  Enables or disables the TMR Capture Compare Channel xN.
  * @param  TMRx: where x can be 1, 8, 15 to select the TMR peripheral.
  * @param  TMR_Channel: specifies the TMR Channel
  *   This parameter can be one of the following values:
  *     @arg TMR_Channel_1: TMR Channel 1
  *     @arg TMR_Channel_2: TMR Channel 2
  *     @arg TMR_Channel_3: TMR Channel 3
  * @param  TMR_CCxN: specifies the TMR Channel CCxNE bit new state.
  *   This parameter can be: TMR_CCxN_Enable or TMR_CCxN_Disable.
  * @retval None
  */
void TMR_CCxNCmd(TMR_Type* TMRx, uint16_t TMR_Channel, uint16_t TMR_CCxN)
{
  uint16_t tmp = 0;

  /* Check the parameters */
  assert_param(IS_TMR_LIST2_PERIPH(TMRx));
  assert_param(IS_TMR_COMPLEMENTARY_CHANNEL(TMR_Channel));
  assert_param(IS_TMR_CCXN(TMR_CCxN));

