RT-Thread/rt-thread/bsp/at32/Libraries/AT32_Std_Driver/AT32F4xx_StdPeriph_Driver/src/at32f4xx_tim.c
  tmp = CCE_CCNE_Set << TMR_Channel;

  /* Reset the CCxNE Bit */
  TMRx->CCE &= (uint16_t) ~tmp;

  /* Set or reset the CCxNE Bit */
  TMRx->CCE |=  (uint16_t)(TMR_CCxN << TMR_Channel);
}

/**
  * @brief  Selects the TMR Output Compare Mode.
  * @note   This function disables the selected channel before changing the Output
  *         Compare Mode.
  *         User has to enable this channel using TMR_CCxCmd and TMR_CCxNCmd functions.
  * @param  TMRx: where x can be 1 to 15 except 6 and 7 to select the TMR peripheral.
  * @param  TMR_Channel: specifies the TMR Channel
  *   This parameter can be one of the following values:
  *     @arg TMR_Channel_1: TMR Channel 1
  *     @arg TMR_Channel_2: TMR Channel 2
  *     @arg TMR_Channel_3: TMR Channel 3
  *     @arg TMR_Channel_4: TMR Channel 4
  * @param  TMR_OCMode: specifies the TMR Output Compare Mode.
  *   This parameter can be one of the following values:
  *     @arg TMR_OCMode_Timing
  *     @arg TMR_OCMode_Active
  *     @arg TMR_OCMode_Toggle
  *     @arg TMR_OCMode_PWM1
  *     @arg TMR_OCMode_PWM2
  *     @arg TMR_ForcedAction_Active
  *     @arg TMR_ForcedAction_InActive
  * @retval None
  */
void TMR_SelectOCxM(TMR_Type* TMRx, uint16_t TMR_Channel, uint16_t TMR_OCMode)
{
  uint32_t tmp = 0;
  uint16_t tmp1 = 0;

  /* Check the parameters */
  assert_param(IS_TMR_LIST8_PERIPH(TMRx));
  assert_param(IS_TMR_CHANNEL(TMR_Channel));
  assert_param(IS_TMR_OCM(TMR_OCMode));

  tmp = (uint32_t) TMRx;
  tmp += CCMR_Offset;

  tmp1 = CCE_CCE_Set << (uint16_t)TMR_Channel;

  /* Disable the Channel: Reset the CCxE Bit */
  TMRx->CCE &= (uint16_t) ~tmp1;

  if((TMR_Channel == TMR_Channel_1) || (TMR_Channel == TMR_Channel_3))
  {
    tmp += (TMR_Channel >> 1);

    /* Reset the OCxM bits in the CCMRx register */
    *(__IO uint32_t *) tmp &= (uint32_t)~((uint32_t)TMR_CCM1_OC1MODE);

    /* Configure the OCxM bits in the CCMRx register */
    *(__IO uint32_t *) tmp |= TMR_OCMode;
  }
  else
  {
    tmp += (uint16_t)(TMR_Channel - (uint16_t)4) >> (uint16_t)1;

    /* Reset the OCxM bits in the CCMRx register */
    *(__IO uint32_t *) tmp &= (uint32_t)~((uint32_t)TMR_CCM1_OC2MODE);

    /* Configure the OCxM bits in the CCMRx register */
    *(__IO uint32_t *) tmp |= (uint16_t)(TMR_OCMode << 8);
  }
}

/**
  * @brief  Enables or Disables the TMRx Update event.
  * @param  TMRx: where x can be 1 to 15 to select the TMR peripheral.
  * @param  NewState: new state of the TMRx UDIS bit
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void TMR_UpdateDisableConfig(TMR_Type* TMRx, FunctionalState NewState)
{
  /* Check the parameters */
  assert_param(IS_TMR_ALL_PERIPH(TMRx));
  assert_param(IS_FUNCTIONAL_STATE(NewState));

  if (NewState != DISABLE)
  {
    /* Set the Update Disable Bit */
    TMRx->CTRL1 |= TMR_CTRL1_UEVDIS;
  }
  else
  {
    /* Reset the Update Disable Bit */
    TMRx->CTRL1 &= (uint16_t)~((uint16_t)TMR_CTRL1_UEVDIS);
  }
}

/**
  * @brief  Configures the TMRx Update Request Interrupt source.
  * @param  TMRx: where x can be 1 to 15 to select the TMR peripheral.
  * @param  TMR_UpdateSource: specifies the Update source.
  *   This parameter can be one of the following values:
  *     @arg TMR_UpdateSource_Regular: Source of update is the counter overflow/underflow
                                       or the setting of UG bit, or an update generation
                                       through the slave mode controller.
  *     @arg TMR_UpdateSource_Global: Source of update is counter overflow/underflow.
  * @retval None
  */
void TMR_UpdateRequestConfig(TMR_Type* TMRx, uint16_t TMR_UpdateSource)
{
  /* Check the parameters */
  assert_param(IS_TMR_ALL_PERIPH(TMRx));
  assert_param(IS_TMR_UPDATE_SOURCE(TMR_UpdateSource));

  if (TMR_UpdateSource != TMR_UpdateSource_Global)
  {
    /* Set the URS Bit */
    TMRx->CTRL1 |= TMR_CTRL1_UVERS;
  }
  else
  {
    /* Reset the URS Bit */
    TMRx->CTRL1 &= (uint16_t)~((uint16_t)TMR_CTRL1_UVERS);
  }
}

/**
  * @brief  Enables or disables the TMRx's Hall sensor interface.
  * @param  TMRx: where x can be 1, 2, 3, 4, 5 or 8 to select the TMR peripheral.
  * @param  NewState: new state of the TMRx Hall sensor interface.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void TMR_SelectHallSensor(TMR_Type* TMRx, FunctionalState NewState)
{
  /* Check the parameters */
  assert_param(IS_TMR_LIST6_PERIPH(TMRx));
  assert_param(IS_FUNCTIONAL_STATE(NewState));

  if (NewState != DISABLE)
  {
    /* Set the TI1S Bit */
    TMRx->CTRL2 |= TMR_CTRL2_TI1SEL;
  }
  else
  {
    /* Reset the TI1S Bit */
    TMRx->CTRL2 &= (uint16_t)~((uint16_t)TMR_CTRL2_TI1SEL);
  }
}

/**
  * @brief  Selects the TMRx's One Pulse Mode.
  * @param  TMRx: where x can be 1 to 15 to select the TMR peripheral.
  * @param  TMR_OPMode: specifies the OPM Mode to be used.
  *   This parameter can be one of the following values:
  *     @arg TMR_OPMode_Once
  *     @arg TMR_OPMode_Repetitive
  * @retval None
  */
void TMR_SelectOnePulseMode(TMR_Type* TMRx, uint16_t TMR_OPMode)
{
  /* Check the parameters */
  assert_param(IS_TMR_ALL_PERIPH(TMRx));
  assert_param(IS_TMR_OPM_MODE(TMR_OPMode));
  /* Reset the OPM Bit */
  TMRx->CTRL1 &= (uint16_t)~((uint16_t)TMR_CTRL1_OPMODE);
  /* Configure the OPM Mode */
  TMRx->CTRL1 |= TMR_OPMode;
}

/**
  * @brief  Selects the TMRx Trigger Output Mode.
  * @param  TMRx: where x can be 1, 2, 3, 4, 5, 6, 7, 8, 9, 12 or 15 to select the TMR peripheral.
  * @param  TMR_TRGOSource: specifies the Trigger Output source.
  *   This paramter can be one of the following values:
  *
  *  - For all TMRx
  *     @arg TMR_TRGOSource_Reset:  The UG bit in the TMR_EGR register is used as the trigger output (TRGO).
  *     @arg TMR_TRGOSource_Enable: The Counter Enable CEN is used as the trigger output (TRGO).
  *     @arg TMR_TRGOSource_Update: The update event is selected as the trigger output (TRGO).
  *
  *  - For all TMRx except TMR6 and TMR7
  *     @arg TMR_TRGOSource_OC1: The trigger output sends a positive pulse when the CC1IF flag
  *                              is to be set, as soon as a capture or compare match occurs (TRGO).
  *     @arg TMR_TRGOSource_OC1Ref: OC1REF signal is used as the trigger output (TRGO).
  *     @arg TMR_TRGOSource_OC2Ref: OC2REF signal is used as the trigger output (TRGO).
  *     @arg TMR_TRGOSource_OC3Ref: OC3REF signal is used as the trigger output (TRGO).
  *     @arg TMR_TRGOSource_OC4Ref: OC4REF signal is used as the trigger output (TRGO).
  *
  * @retval None
  */
void TMR_SelectOutputTrigger(TMR_Type* TMRx, uint16_t TMR_TRGOSource)
{
  /* Check the parameters */
  assert_param(IS_TMR_LIST7_PERIPH(TMRx));
  assert_param(IS_TMR_TRGO_SOURCE(TMR_TRGOSource));
  /* Reset the MMS Bits */
  TMRx->CTRL2 &= (uint16_t)~((uint16_t)TMR_CTRL2_MMSEL);
  /* Select the TRGO source */
  TMRx->CTRL2 |=  TMR_TRGOSource;
}

/**
  * @brief  Selects the TMRx Slave Mode.
  * @param  TMRx: where x can be 1, 2, 3, 4, 5, 8, 9, 12 or 15 to select the TMR peripheral.
  * @param  TMR_SlaveMode: specifies the Timer Slave Mode.
  *   This parameter can be one of the following values:
  *     @arg TMR_SlaveMode_Reset: Rising edge of the selected trigger signal (TRGI) re-initializes
  *                               the counter and triggers an update of the registers.
  *     @arg TMR_SlaveMode_Gate:     The counter clock is enabled when the trigger signal (TRGI) is high.
  *     @arg TMR_SlaveMode_Trigger:   The counter starts at a rising edge of the trigger TRGI.
  *     @arg TMR_SlaveMode_External1: Rising edges of the selected trigger (TRGI) clock the counter.
  * @retval None
  */
void TMR_SelectSlaveMode(TMR_Type* TMRx, uint16_t TMR_SlaveMode)
{
  /* Check the parameters */
  assert_param(IS_TMR_LIST6_PERIPH(TMRx));
  assert_param(IS_TMR_SLAVE_MODE(TMR_SlaveMode));
  /* Reset the SMS Bits */
  TMRx->SMC &= (uint16_t)~((uint16_t)TMR_SMC_SMSEL);
  /* Select the Slave Mode */
  TMRx->SMC |= TMR_SlaveMode;
}

/**
  * @brief  Sets or Resets the TMRx Master/Slave Mode.
  * @param  TMRx: where x can be 1, 2, 3, 4, 5, 8, 9, 12 or 15 to select the TMR peripheral.
  * @param  TMR_MasterSlaveMode: specifies the Timer Master Slave Mode.
  *   This parameter can be one of the following values:
  *     @arg TMR_MasterSlaveMode_Enable: synchronization between the current timer
  *                                      and its slaves (through TRGO).
  *     @arg TMR_MasterSlaveMode_Disable: No action
  * @retval None
  */
void TMR_SelectMasterSlaveMode(TMR_Type* TMRx, uint16_t TMR_MasterSlaveMode)
{
  /* Check the parameters */
  assert_param(IS_TMR_LIST6_PERIPH(TMRx));
  assert_param(IS_TMR_MSMODE_STATE(TMR_MasterSlaveMode));
  /* Reset the MSM Bit */
  TMRx->SMC &= (uint16_t)~((uint16_t)TMR_SMC_MSMODE);

  /* Set or Reset the MSM Bit */
  TMRx->SMC |= TMR_MasterSlaveMode;
}

/**
  * @brief  Sets the TMRx Counter Register value
  * @param  TMRx: where x can be 1 to 15 to select the TMR peripheral.
  * @param  Counter: specifies the Counter register new value.
  * @retval None
  */
void TMR_SetCounter(TMR_Type* TMRx, uint32_t Counter)
{
  /* Check the parameters */
  assert_param(IS_TMR_ALL_PERIPH(TMRx));
  /* Set the Counter Register value */
  TMRx->CNT = Counter;
}

/**
  * @brief  Sets the TMRx Autoreload Register value
  * @param  TMRx: where x can be 1 to 15 to select the TMR peripheral.
  * @param  Autoreload: specifies the Autoreload register new value.
  * @retval None
  */
void TMR_SetAutoreload(TMR_Type* TMRx, uint32_t Autoreload)
{
  /* Check the parameters */
  assert_param(IS_TMR_ALL_PERIPH(TMRx));
  /* Set the Autoreload Register value */
  TMRx->AR = Autoreload;
}

/**
  * @brief  Sets the TMRx Capture Compare1 Register value
  * @param  TMRx: where x can be 1 to 15 except 6 and 7 to select the TMR peripheral.
  * @param  Compare1: specifies the Capture Compare1 register new value.
  * @retval None
  */
void TMR_SetCompare1(TMR_Type* TMRx, uint32_t Compare1)
{
  /* Check the parameters */
  assert_param(IS_TMR_LIST8_PERIPH(TMRx));
  /* Set the Capture Compare1 Register value */
  TMRx->CC1 = Compare1;
}

/**
  * @brief  Sets the TMRx Capture Compare2 Register value
  * @param  TMRx: where x can be 1, 2, 3, 4, 5, 8, 9, 12 or 15 to select the TMR peripheral.
  * @param  Compare2: specifies the Capture Compare2 register new value.
  * @retval None
  */
void TMR_SetCompare2(TMR_Type* TMRx, uint32_t Compare2)
{
  /* Check the parameters */
  assert_param(IS_TMR_LIST6_PERIPH(TMRx));
  /* Set the Capture Compare2 Register value */
  TMRx->CC2 = Compare2;
}

/**
  * @brief  Sets the TMRx Capture Compare3 Register value
  * @param  TMRx: where x can be 1, 2, 3, 4, 5 or 8 to select the TMR peripheral.
  * @param  Compare3: specifies the Capture Compare3 register new value.
  * @retval None
  */
void TMR_SetCompare3(TMR_Type* TMRx, uint32_t Compare3)
{
  /* Check the parameters */
  assert_param(IS_TMR_LIST3_PERIPH(TMRx));
  /* Set the Capture Compare3 Register value */
  TMRx->CC3 = Compare3;
}

/**
  * @brief  Sets the TMRx Capture Compare4 Register value
  * @param  TMRx: where x can be 1, 2, 3, 4, 5 or 8 to select the TMR peripheral.
  * @param  Compare4: specifies the Capture Compare4 register new value.
  * @retval None
  */
void TMR_SetCompare4(TMR_Type* TMRx, uint32_t Compare4)
{
  /* Check the parameters */
  assert_param(IS_TMR_LIST3_PERIPH(TMRx));
  /* Set the Capture Compare4 Register value */
  TMRx->CC4 = Compare4;
}

/**
  * @brief  Sets the TMRx Input Capture 1 prescaler.
  * @param  TMRx: where x can be 1 to 15 except 6 and 7 to select the TMR peripheral.
  * @param  TMR_ICPSC: specifies the Input Capture1 prescaler new value.
  *   This parameter can be one of the following values:
  *     @arg TMR_ICDIV_DIV1: no prescaler
  *     @arg TMR_ICDIV_DIV2: capture is done once every 2 events
  *     @arg TMR_ICDIV_DIV4: capture is done once every 4 events
  *     @arg TMR_ICDIV_DIV8: capture is done once every 8 events
  * @retval None
  */
void TMR_SetIC1DIV(TMR_Type* TMRx, uint16_t TMR_ICPSC)
{
  /* Check the parameters */
  assert_param(IS_TMR_LIST8_PERIPH(TMRx));
  assert_param(IS_TMR_IC_DIV(TMR_ICPSC));
  /* Reset the IC1PSC Bits */
  TMRx->CCM1 &= (uint16_t)~((uint16_t)TMR_CCM1_IC1DIV);
  /* Set the IC1PSC value */
  TMRx->CCM1 |= TMR_ICPSC;
}

/**
  * @brief  Sets the TMRx Input Capture 2 prescaler.
  * @param  TMRx: where x can be 1, 2, 3, 4, 5, 8, 9, 12 or 15 to select the TMR peripheral.
  * @param  TMR_ICPSC: specifies the Input Capture2 prescaler new value.
  *   This parameter can be one of the following values:
  *     @arg TMR_ICDIV_DIV1: no prescaler
  *     @arg TMR_ICDIV_DIV2: capture is done once every 2 events
  *     @arg TMR_ICDIV_DIV4: capture is done once every 4 events
  *     @arg TMR_ICDIV_DIV8: capture is done once every 8 events
  * @retval None
  */
void TMR_SetIC2DIV(TMR_Type* TMRx, uint16_t TMR_ICPSC)
{
  /* Check the parameters */
  assert_param(IS_TMR_LIST6_PERIPH(TMRx));
  assert_param(IS_TMR_IC_DIV(TMR_ICPSC));
  /* Reset the IC2PSC Bits */
  TMRx->CCM1 &= (uint16_t)~((uint16_t)TMR_CCM1_IC2DIV);
  /* Set the IC2PSC value */
  TMRx->CCM1 |= (uint16_t)(TMR_ICPSC << 8);
}

/**
  * @brief  Sets the TMRx Input Capture 3 prescaler.
  * @param  TMRx: where x can be 1, 2, 3, 4, 5 or 8 to select the TMR peripheral.
  * @param  TMR_ICPSC: specifies the Input Capture3 prescaler new value.
  *   This parameter can be one of the following values:
  *     @arg TMR_ICDIV_DIV1: no prescaler
  *     @arg TMR_ICDIV_DIV2: capture is done once every 2 events
  *     @arg TMR_ICDIV_DIV4: capture is done once every 4 events
  *     @arg TMR_ICDIV_DIV8: capture is done once every 8 events
  * @retval None
  */
void TMR_SetIC3DIV(TMR_Type* TMRx, uint16_t TMR_ICPSC)
{
  /* Check the parameters */
  assert_param(IS_TMR_LIST3_PERIPH(TMRx));
  assert_param(IS_TMR_IC_DIV(TMR_ICPSC));
  /* Reset the IC3PSC Bits */
  TMRx->CCM2 &= (uint16_t)~((uint16_t)TMR_CCM2_IC3DIV);
  /* Set the IC3PSC value */
  TMRx->CCM2 |= TMR_ICPSC;
}

/**
  * @brief  Sets the TMRx Input Capture 4 prescaler.
  * @param  TMRx: where x can be 1, 2, 3, 4, 5 or 8 to select the TMR peripheral.
  * @param  TMR_ICPSC: specifies the Input Capture4 prescaler new value.
  *   This parameter can be one of the following values:
  *     @arg TMR_ICDIV_DIV1: no prescaler
  *     @arg TMR_ICDIV_DIV2: capture is done once every 2 events
  *     @arg TMR_ICDIV_DIV4: capture is done once every 4 events
  *     @arg TMR_ICDIV_DIV8: capture is done once every 8 events
  * @retval None
  */
void TMR_SetIC4DIV(TMR_Type* TMRx, uint16_t TMR_ICPSC)
{
  /* Check the parameters */
  assert_param(IS_TMR_LIST3_PERIPH(TMRx));
  assert_param(IS_TMR_IC_DIV(TMR_ICPSC));
  /* Reset the IC4PSC Bits */
  TMRx->CCM2 &= (uint16_t)~((uint16_t)TMR_CCM2_IC4DIV);
  /* Set the IC4PSC value */
  TMRx->CCM2 |= (uint16_t)(TMR_ICPSC << 8);
}

/**
  * @brief  Sets the TMRx Clock Division value.
  * @param  TMRx: where x can be  1 to 15 except 6 and 7 to select
  *   the TMR peripheral.
  * @param  TMR_CKD: specifies the clock division value.
  *   This parameter can be one of the following value:
  *     @arg TMR_CKD_DIV1: TDTS = Tck_tim
  *     @arg TMR_CKD_DIV2: TDTS = 2*Tck_tim
  *     @arg TMR_CKD_DIV4: TDTS = 4*Tck_tim
  * @retval None
  */
void TMR_SetClockDivision(TMR_Type* TMRx, uint16_t TMR_CKD)
{
  /* Check the parameters */
  assert_param(IS_TMR_LIST8_PERIPH(TMRx));
  assert_param(IS_TMR_CKD_DIV(TMR_CKD));
  /* Reset the CKD Bits */
  TMRx->CTRL1 &= (uint16_t)~((uint16_t)TMR_CTRL1_CLKDIV);
  /* Set the CKD value */
  TMRx->CTRL1 |= TMR_CKD;
}

/**
  * @brief  Gets the TMRx Input Capture 1 value.
  * @param  TMRx: where x can be 1 to 15 except 6 and 7 to select the TMR peripheral.
  * @retval Capture Compare 1 Register value.
  */
uint32_t TMR_GetCapture1(TMR_Type* TMRx)
{
  /* Check the parameters */
  assert_param(IS_TMR_LIST8_PERIPH(TMRx));
  /* Get the Capture 1 Register value */
  return TMRx->CC1;
}

/**
  * @brief  Gets the TMRx Input Capture 2 value.
  * @param  TMRx: where x can be 1, 2, 3, 4, 5, 8, 9, 12 or 15 to select the TMR peripheral.
  * @retval Capture Compare 2 Register value.
  */
uint32_t TMR_GetCapture2(TMR_Type* TMRx)
{
  /* Check the parameters */
  assert_param(IS_TMR_LIST6_PERIPH(TMRx));
  /* Get the Capture 2 Register value */
  return TMRx->CC2;
}

/**
  * @brief  Gets the TMRx Input Capture 3 value.
  * @param  TMRx: where x can be 1, 2, 3, 4, 5 or 8 to select the TMR peripheral.
  * @retval Capture Compare 3 Register value.
  */
uint32_t TMR_GetCapture3(TMR_Type* TMRx)
{
  /* Check the parameters */
  assert_param(IS_TMR_LIST3_PERIPH(TMRx));
  /* Get the Capture 3 Register value */
  return TMRx->CC3;
}

/**
  * @brief  Gets the TMRx Input Capture 4 value.
  * @param  TMRx: where x can be 1, 2, 3, 4, 5 or 8 to select the TMR peripheral.
  * @retval Capture Compare 4 Register value.
  */
uint32_t TMR_GetCapture4(TMR_Type* TMRx)
{
  /* Check the parameters */
  assert_param(IS_TMR_LIST3_PERIPH(TMRx));
  /* Get the Capture 4 Register value */
  return TMRx->CC4;
}

/**
  * @brief  Gets the TMRx Counter value.
  * @param  TMRx: where x can be 1 to 15 to select the TMR peripheral.
  * @retval Counter Register value.
  */
uint32_t TMR_GetCounter(TMR_Type* TMRx)
{
  /* Check the parameters */
  assert_param(IS_TMR_ALL_PERIPH(TMRx));
  /* Get the Counter Register value */
  return TMRx->CNT;
}

/**
  * @brief  Gets the TMRx Prescaler value.
  * @param  TMRx: where x can be 1 to 15 to select the TMR peripheral.
  * @retval Prescaler Register value.
  */
uint16_t TMR_GetDIV(TMR_Type* TMRx)
{
  /* Check the parameters */
  assert_param(IS_TMR_ALL_PERIPH(TMRx));
  /* Get the Prescaler Register value */
  return TMRx->DIV;
}

/**
  * @brief  Checks whether the specified TMR flag is set or not.
  * @param  TMRx: where x can be 1 to 15 to select the TMR peripheral.
  * @param  TMR_FLAG: specifies the flag to check.
  *   This parameter can be one of the following values:
  *     @arg TMR_FLAG_Update: TMR update Flag
  *     @arg TMR_FLAG_CC1: TMR Capture Compare 1 Flag
  *     @arg TMR_FLAG_CC2: TMR Capture Compare 2 Flag
  *     @arg TMR_FLAG_CC3: TMR Capture Compare 3 Flag
  *     @arg TMR_FLAG_CC4: TMR Capture Compare 4 Flag
  *     @arg TMR_FLAG_HALL: TMR Commutation Flag
  *     @arg TMR_FLAG_Trigger: TMR Trigger Flag
  *     @arg TMR_FLAG_Break: TMR Break Flag
  *     @arg TMR_FLAG_C1OF: TMR Capture Compare 1 overcapture Flag
  *     @arg TMR_FLAG_C2OF: TMR Capture Compare 2 overcapture Flag
  *     @arg TMR_FLAG_C3OF: TMR Capture Compare 3 overcapture Flag
  *     @arg TMR_FLAG_C4OF: TMR Capture Compare 4 overcapture Flag
  * @note
  *   - TMR6 and TMR7 can have only one update flag.
  *   - TMR9, TMR12 and TMR15 can have only TMR_FLAG_Update, TMR_FLAG_CC1,
  *      TMR_FLAG_CC2 or TMR_FLAG_Trigger.
  *   - TMR10, TMR11, TMR13, TMR14 can have TMR_FLAG_Update or TMR_FLAG_CC1.
  *   - TMR_FLAG_Break is used only with TMR1, TMR8 and TMR15.
  *   - TMR_FLAG_HALL is used only with TMR1, TMR8, TMR15.
  * @retval The new state of TMR_FLAG (SET or RESET).
  */
FlagStatus TMR_GetFlagStatus(TMR_Type* TMRx, uint16_t TMR_FLAG)
{
  ITStatus bitstatus = RESET;
  /* Check the parameters */
  assert_param(IS_TMR_ALL_PERIPH(TMRx));
  assert_param(IS_TMR_GET_FLAG(TMR_FLAG));

  if ((TMRx->STS & TMR_FLAG) != (uint16_t)RESET)
  {
    bitstatus = SET;
  }
  else
  {
    bitstatus = RESET;
  }

