RT-Thread/rt-thread/bsp/at32/Libraries/AT32_Std_Driver/AT32F4xx_StdPeriph_Driver/src/at32f4xx_tim.c
  return bitstatus;
}

/**
  * @brief  Clears the TMRx's pending flags.
  * @param  TMRx: where x can be 1 to 15 to select the TMR peripheral.
  * @param  TMR_FLAG: specifies the flag bit to clear.
  *   This parameter can be any combination of the following values:
  *     @arg TMR_FLAG_Update: TMR update Flag
  *     @arg TMR_FLAG_CC1: TMR Capture Compare 1 Flag
  *     @arg TMR_FLAG_CC2: TMR Capture Compare 2 Flag
  *     @arg TMR_FLAG_CC3: TMR Capture Compare 3 Flag
  *     @arg TMR_FLAG_CC4: TMR Capture Compare 4 Flag
  *     @arg TMR_FLAG_HALL: TMR Commutation Flag
  *     @arg TMR_FLAG_Trigger: TMR Trigger Flag
  *     @arg TMR_FLAG_Break: TMR Break Flag
  *     @arg TMR_FLAG_C1OF: TMR Capture Compare 1 overcapture Flag
  *     @arg TMR_FLAG_C2OF: TMR Capture Compare 2 overcapture Flag
  *     @arg TMR_FLAG_C3OF: TMR Capture Compare 3 overcapture Flag
  *     @arg TMR_FLAG_C4OF: TMR Capture Compare 4 overcapture Flag
  * @note
  *   - TMR6 and TMR7 can have only one update flag.
  *   - TMR9, TMR12 and TMR15 can have only TMR_FLAG_Update, TMR_FLAG_CC1,
  *      TMR_FLAG_CC2 or TMR_FLAG_Trigger.
  *   - TMR10, TMR11, TMR13, TMR14 can have TMR_FLAG_Update or TMR_FLAG_CC1.
  *   - TMR_FLAG_Break is used only with TMR1, TMR8 and TMR15.
  *   - TMR_FLAG_HALL is used only with TMR1, TMR8, TMR15.
  * @retval None
  */
void TMR_ClearFlag(TMR_Type* TMRx, uint16_t TMR_FLAG)
{
  /* Check the parameters */
  assert_param(IS_TMR_ALL_PERIPH(TMRx));
  assert_param(IS_TMR_CLEAR_FLAG(TMR_FLAG));

  /* Clear the flags */
  TMRx->STS = (uint16_t)~TMR_FLAG;
}

/**
  * @brief  Checks whether the TMR interrupt has occurred or not.
  * @param  TMRx: where x can be 1 to 15 to select the TMR peripheral.
  * @param  TMR_INT: specifies the TMR interrupt source to check.
  *   This parameter can be one of the following values:
  *     @arg TMR_INT_Overflow: TMR update Interrupt source
  *     @arg TMR_INT_CC1: TMR Capture Compare 1 Interrupt source
  *     @arg TMR_INT_CC2: TMR Capture Compare 2 Interrupt source
  *     @arg TMR_INT_CC3: TMR Capture Compare 3 Interrupt source
  *     @arg TMR_INT_CC4: TMR Capture Compare 4 Interrupt source
  *     @arg TMR_INT_HALL: TMR Commutation Interrupt source
  *     @arg TMR_INT_Trigger: TMR Trigger Interrupt source
  *     @arg TMR_INT_Break: TMR Break Interrupt source
  * @note
  *   - TMR6 and TMR7 can generate only an update interrupt.
  *   - TMR9, TMR12 and TMR15 can have only TMR_INT_Overflow, TMR_INT_CC1,
  *      TMR_INT_CC2 or TMR_INT_Trigger.
  *   - TMR10, TMR11, TMR13, TMR14 can have TMR_INT_Overflow or TMR_INT_CC1.
  *   - TMR_INT_Break is used only with TMR1, TMR8 and TMR15.
  *   - TMR_INT_HALL is used only with TMR1, TMR8, TMR15.
  * @retval The new state of the TMR_INT(SET or RESET).
  */
ITStatus TMR_GetINTStatus(TMR_Type* TMRx, uint16_t TMR_INT)
{
  ITStatus bitstatus = RESET;
  uint16_t itstatus = 0x0, itenable = 0x0;
  /* Check the parameters */
  assert_param(IS_TMR_ALL_PERIPH(TMRx));
  assert_param(IS_TMR_GET_INT(TMR_INT));

  itstatus = TMRx->STS & TMR_INT;

  itenable = TMRx->DIE & TMR_INT;

  if ((itstatus != (uint16_t)RESET) && (itenable != (uint16_t)RESET))
  {
    bitstatus = SET;
  }
  else
  {
    bitstatus = RESET;
  }

  return bitstatus;
}

/**
  * @brief  Clears the TMRx's interrupt pending bits.
  * @param  TMRx: where x can be 1 to 15 to select the TMR peripheral.
  * @param  TMR_INT: specifies the pending bit to clear.
  *   This parameter can be any combination of the following values:
  *     @arg TMR_INT_Overflow: TMR1 update Interrupt source
  *     @arg TMR_INT_CC1: TMR Capture Compare 1 Interrupt source
  *     @arg TMR_INT_CC2: TMR Capture Compare 2 Interrupt source
  *     @arg TMR_INT_CC3: TMR Capture Compare 3 Interrupt source
  *     @arg TMR_INT_CC4: TMR Capture Compare 4 Interrupt source
  *     @arg TMR_INT_HALL: TMR Commutation Interrupt source
  *     @arg TMR_INT_Trigger: TMR Trigger Interrupt source
  *     @arg TMR_INT_Break: TMR Break Interrupt source
  * @note
  *   - TMR6 and TMR7 can generate only an update interrupt.
  *   - TMR9, TMR12 and TMR15 can have only TMR_INT_Overflow, TMR_INT_CC1,
  *      TMR_INT_CC2 or TMR_INT_Trigger.
  *   - TMR10, TMR11, TMR13, TMR14 can have TMR_INT_Overflow or TMR_INT_CC1.
  *   - TMR_INT_Break is used only with TMR1, TMR8 and TMR15.
  *   - TMR_INT_HALL is used only with TMR1, TMR8, TMR15.
  * @retval None
  */
void TMR_ClearITPendingBit(TMR_Type* TMRx, uint16_t TMR_INT)
{
  /* Check the parameters */
  assert_param(IS_TMR_ALL_PERIPH(TMRx));
  assert_param(IS_TMR_INT(TMR_INT));
  /* Clear the INT pending Bit */
  TMRx->STS = (uint16_t)~TMR_INT;
}

/**
  * @brief  Configure the TI1 as Input.
  * @param  TMRx: where x can be 1 to 15 except 6 and 7 to select the TMR peripheral.
  * @param  TMR_ICPolarity : The Input Polarity.
  *   This parameter can be one of the following values:
  *     @arg TMR_ICPolarity_Rising
  *     @arg TMR_ICPolarity_Falling
  * @param  TMR_ICSelection: specifies the input to be used.
  *   This parameter can be one of the following values:
  *     @arg TMR_ICSelection_DirectTI: TMR Input 1 is selected to be connected to IC1.
  *     @arg TMR_ICSelection_IndirectTI: TMR Input 1 is selected to be connected to IC2.
  *     @arg TMR_ICSelection_TRC: TMR Input 1 is selected to be connected to TRC.
  * @param  TMR_ICFilter: Specifies the Input Capture Filter.
  *   This parameter must be a value between 0x00 and 0x0F.
  * @retval None
  */
static void TI1_Config(TMR_Type* TMRx, uint16_t TMR_ICPolarity, uint16_t TMR_ICSelection,
                       uint16_t TMR_ICFilter)
{
  uint16_t tmpccmr1 = 0, tmpccer = 0;
  /* Disable the Channel 1: Reset the CC1E Bit */
  TMRx->CCE &= (uint16_t)~((uint16_t)TMR_CCE_C1EN);
  tmpccmr1 = TMRx->CCM1;
  tmpccer = TMRx->CCE;
  /* Select the Input and set the filter */
  tmpccmr1 &= (uint16_t)(((uint16_t)~((uint16_t)TMR_CCM1_C1SEL)) & ((uint16_t)~((uint16_t)TMR_CCM1_IC1F)));
  tmpccmr1 |= (uint16_t)(TMR_ICSelection | (uint16_t)(TMR_ICFilter << (uint16_t)4));


  if((TMRx == TMR1) || (TMRx == TMR2) ||
#if !defined (AT32F415xx)
     (TMRx == TMR8) ||
#endif
#if defined (AT32F403xx)
     (TMRx == TMR15) ||
#endif
      (TMRx == TMR3) || (TMRx == TMR4) || (TMRx == TMR5))
  {
    /* Select the Polarity and set the CC1E Bit */
    tmpccer &= (uint16_t)~((uint16_t)(TMR_CCE_C1P));
    tmpccer |= (uint16_t)(TMR_ICPolarity | (uint16_t)TMR_CCE_C1EN);
  }
  else
  {
    /* Select the Polarity and set the CC1E Bit */
    tmpccer &= (uint16_t)~((uint16_t)(TMR_CCE_C1P | TMR_CCE_C1NP));
    tmpccer |= (uint16_t)(TMR_ICPolarity | (uint16_t)TMR_CCE_C1EN);
  }

  /* Write to TMRx CCMR1 and CCE registers */
  TMRx->CCM1 = tmpccmr1;
  TMRx->CCE = tmpccer;
}

/**
  * @brief  Configure the TI2 as Input.
  * @param  TMRx: where x can be 1, 2, 3, 4, 5, 8, 9, 12 or 15 to select the TMR peripheral.
  * @param  TMR_ICPolarity : The Input Polarity.
  *   This parameter can be one of the following values:
  *     @arg TMR_ICPolarity_Rising
  *     @arg TMR_ICPolarity_Falling
  * @param  TMR_ICSelection: specifies the input to be used.
  *   This parameter can be one of the following values:
  *     @arg TMR_ICSelection_DirectTI: TMR Input 2 is selected to be connected to IC2.
  *     @arg TMR_ICSelection_IndirectTI: TMR Input 2 is selected to be connected to IC1.
  *     @arg TMR_ICSelection_TRC: TMR Input 2 is selected to be connected to TRC.
  * @param  TMR_ICFilter: Specifies the Input Capture Filter.
  *   This parameter must be a value between 0x00 and 0x0F.
  * @retval None
  */
static void TI2_Config(TMR_Type* TMRx, uint16_t TMR_ICPolarity, uint16_t TMR_ICSelection,
                       uint16_t TMR_ICFilter)
{
  uint16_t tmpccmr1 = 0, tmpccer = 0, tmp = 0;
  /* Disable the Channel 2: Reset the CC2E Bit */
  TMRx->CCE &= (uint16_t)~((uint16_t)TMR_CCE_C2EN);
  tmpccmr1 = TMRx->CCM1;
  tmpccer = TMRx->CCE;
  tmp = (uint16_t)(TMR_ICPolarity << 4);
  /* Select the Input and set the filter */
  tmpccmr1 &= (uint16_t)(((uint16_t)~((uint16_t)TMR_CCM1_C2SEL)) & ((uint16_t)~((uint16_t)TMR_CCM1_IC2DF)));
  tmpccmr1 |= (uint16_t)(TMR_ICFilter << 12);
  tmpccmr1 |= (uint16_t)(TMR_ICSelection << 8);

  if((TMRx == TMR1) || (TMRx == TMR2) ||
#if !defined (AT32F415xx)
     (TMRx == TMR8) ||
#endif
#if defined (AT32F403xx)
     (TMRx == TMR15) ||
#endif
      (TMRx == TMR3) || (TMRx == TMR4) || (TMRx == TMR5))
  {
    /* Select the Polarity and set the CC2E Bit */
    tmpccer &= (uint16_t)~((uint16_t)(TMR_CCE_C2P));
    tmpccer |=  (uint16_t)(tmp | (uint16_t)TMR_CCE_C2EN);
  }
  else
  {
    /* Select the Polarity and set the CC2E Bit */
    tmpccer &= (uint16_t)~((uint16_t)(TMR_CCE_C2P | TMR_CCE_C2NP));
    tmpccer |= (uint16_t)(tmp  | (uint16_t)TMR_CCE_C2EN);
  }

  /* Write to TMRx CCMR1 and CCE registers */
  TMRx->CCM1 = tmpccmr1 ;
  TMRx->CCE = tmpccer;
}

/**
  * @brief  Configure the TI3 as Input.
  * @param  TMRx: where x can be 1, 2, 3, 4, 5 or 8 to select the TMR peripheral.
  * @param  TMR_ICPolarity : The Input Polarity.
  *   This parameter can be one of the following values:
  *     @arg TMR_ICPolarity_Rising
  *     @arg TMR_ICPolarity_Falling
  * @param  TMR_ICSelection: specifies the input to be used.
  *   This parameter can be one of the following values:
  *     @arg TMR_ICSelection_DirectTI: TMR Input 3 is selected to be connected to IC3.
  *     @arg TMR_ICSelection_IndirectTI: TMR Input 3 is selected to be connected to IC4.
  *     @arg TMR_ICSelection_TRC: TMR Input 3 is selected to be connected to TRC.
  * @param  TMR_ICFilter: Specifies the Input Capture Filter.
  *   This parameter must be a value between 0x00 and 0x0F.
  * @retval None
  */
static void TI3_Config(TMR_Type* TMRx, uint16_t TMR_ICPolarity, uint16_t TMR_ICSelection,
                       uint16_t TMR_ICFilter)
{
  uint16_t tmpccmr2 = 0, tmpccer = 0, tmp = 0;
  /* Disable the Channel 3: Reset the CC3E Bit */
  TMRx->CCE &= (uint16_t)~((uint16_t)TMR_CCE_C3EN);
  tmpccmr2 = TMRx->CCM2;
  tmpccer = TMRx->CCE;
  tmp = (uint16_t)(TMR_ICPolarity << 8);
  /* Select the Input and set the filter */
  tmpccmr2 &= (uint16_t)(((uint16_t)~((uint16_t)TMR_CCM2_C3SEL)) & ((uint16_t)~((uint16_t)TMR_CCM2_IC3DF)));
  tmpccmr2 |= (uint16_t)(TMR_ICSelection | (uint16_t)(TMR_ICFilter << (uint16_t)4));

  if((TMRx == TMR1) || (TMRx == TMR2) ||
#if !defined (AT32F415xx)
     (TMRx == TMR8) ||
#endif
#if defined (AT32F403xx)
     (TMRx == TMR15) ||
#endif
      (TMRx == TMR3) || (TMRx == TMR4) || (TMRx == TMR5))
  {
    /* Select the Polarity and set the CC3E Bit */
    tmpccer &= (uint16_t)~((uint16_t)(TMR_CCE_C3P));
    tmpccer |= (uint16_t)(tmp | (uint16_t)TMR_CCE_C3EN);
  }
  else
  {
    /* Select the Polarity and set the CC3E Bit */
    tmpccer &= (uint16_t)~((uint16_t)(TMR_CCE_C3P | TMR_CCE_C3NP));
    tmpccer |= (uint16_t)(tmp | (uint16_t)TMR_CCE_C3EN);
  }

  /* Write to TMRx CCMR2 and CCE registers */
  TMRx->CCM2 = tmpccmr2;
  TMRx->CCE = tmpccer;
}

/**
  * @brief  Configure the TI4 as Input.
  * @param  TMRx: where x can be 1, 2, 3, 4, 5 or 8 to select the TMR peripheral.
  * @param  TMR_ICPolarity : The Input Polarity.
  *   This parameter can be one of the following values:
  *     @arg TMR_ICPolarity_Rising
  *     @arg TMR_ICPolarity_Falling
  * @param  TMR_ICSelection: specifies the input to be used.
  *   This parameter can be one of the following values:
  *     @arg TMR_ICSelection_DirectTI: TMR Input 4 is selected to be connected to IC4.
  *     @arg TMR_ICSelection_IndirectTI: TMR Input 4 is selected to be connected to IC3.
  *     @arg TMR_ICSelection_TRC: TMR Input 4 is selected to be connected to TRC.
  * @param  TMR_ICFilter: Specifies the Input Capture Filter.
  *   This parameter must be a value between 0x00 and 0x0F.
  * @retval None
  */
static void TI4_Config(TMR_Type* TMRx, uint16_t TMR_ICPolarity, uint16_t TMR_ICSelection,
                       uint16_t TMR_ICFilter)
{
  uint16_t tmpccmr2 = 0, tmpccer = 0, tmp = 0;

  /* Disable the Channel 4: Reset the CC4E Bit */
  TMRx->CCE &= (uint16_t)~((uint16_t)TMR_CCE_C4EN);
  tmpccmr2 = TMRx->CCM2;
  tmpccer = TMRx->CCE;
  tmp = (uint16_t)(TMR_ICPolarity << 12);
  /* Select the Input and set the filter */
  tmpccmr2 &= (uint16_t)((uint16_t)(~(uint16_t)TMR_CCM2_CC4S) & ((uint16_t)~((uint16_t)TMR_CCM2_IC4DF)));
  tmpccmr2 |= (uint16_t)(TMR_ICSelection << 8);
  tmpccmr2 |= (uint16_t)(TMR_ICFilter << 12);

  if((TMRx == TMR1) || (TMRx == TMR2) ||
#if !defined (AT32F415xx)
     (TMRx == TMR8) ||
#endif
#if defined (AT32F403xx)
     (TMRx == TMR15) ||
#endif
      (TMRx == TMR3) || (TMRx == TMR4) || (TMRx == TMR5))
  {
    /* Select the Polarity and set the CC4E Bit */
    tmpccer &= (uint16_t)~((uint16_t)(TMR_CCE_C4P));
    tmpccer |= (uint16_t)(tmp | (uint16_t)TMR_CCE_C4EN);
  }
  else
  {
    /* Select the Polarity and set the CC4E Bit */
    tmpccer &= (uint16_t)~((uint16_t)(TMR_CCE_C3P | TMR_CCE_C4NP));
    tmpccer |= (uint16_t)(tmp | (uint16_t)TMR_CCE_C4EN);
  }

  /* Write to TMRx CCMR2 and CCE registers */
  TMRx->CCM2 = tmpccmr2;
  TMRx->CCE = tmpccer;
}

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */


